{
  "name": "Beastmaster",
  "safe_name": "beastmaster",
  "strategies": {
    "general_tips": [
      "You can use Wild Axes to cut down the treeline next to you to improve your vision when laning.",
      "The Wild Axes damage amp debuff increases damage you deal to the target with spells, attacks, and items.",
      "The Wild Axes damage amp debuff doesn't last that long, but is refreshed every time a target gets hit by the Axes. It's difficult to consistently keep stacks up on an enemy hero, but the amp does work on Rosh.",
      "The Boar does not draw aggro from lane creeps. This means that you can have the Boar spit at an enemy hero all day and they'll have to kill it themselves.",
      "The Hawk will draw aggro from lane creeps before 5 minutes. This is definitely not intended behavior, so please let me know when this tip stops working.",
      "If you have a Blink Dagger and you're chasing someone, wait to summon your Boar until after you Blink.",
      "Try to aim Primal Roar like a Burrowstrike if possible. You'll only be able to stun your primary target, but any enemies caught in the line of fire will be disabled, pushed, slowed, and take damage.That's right, units in the AoE are fully disabled during the knockback of the Roar, so you can break channels even if the enemy wasn't the primary target. Handy against Linken's carriers.",
      "That's right, units in the AoE are fully disabled during the knockback of the Roar, so you can break channels even if the enemy wasn't the primary target. Handy against Linken's carriers.",
      "Primal Roar can be used to stun couriers, but won't damage them."
    ],
    "counter_tips": [
      "Take the time to kill the Boar in lane. Use spells on it if you have to. The Boar is what makes Beastmaster an incredibly strong laner and the cooldown is fairly long. Kill it as soon as he summons it and he'll be far less aggressive.",
      "Heroes with spells that notably affect creeps can be useful at killing Beastmaster's summons. Clinkz's Death Pact, Crystal Maiden's Frostbite, Doom's Devour, Enchantress's Enchant, Mirana's Sacred Arrow, and Pudge's Meat Hook are a few specific examples.",
      "Beastmaster's Hawk can be killed just like any other summon.",
      "Winter Wyvern can turn Beastmaster's army against himself with Winter's Curse."
    ]
  }
}