{
  "name": "Bounty Hunter",
  "safe_name": "bounty_hunter",
  "strategies": {
    "general_tips": [
      "Shuriken will bounce to Tracked targets even if the initial target isn't Tracked. Try hitting a non-Tracked unit first (like a creep) to reach a distant target.Shuriken searches for another bounce target on impact, so you can Track a new target while its flying around to get another bounce.",
      "Shuriken searches for another bounce target on impact, so you can Track a new target while its flying around to get another bounce.",
      "If you're ganking a solo target with the \"Through and Through\" facet, you should Track them, get real close them, and then cast Shuriken on a unit behind them to get the passthrough damage, and then let it Track bounce back to them.",
      "Manually casting Jinada on an enemy hero will not draw aggro from creeps.",
      "Shadow Walk has a visible cast animation even if you're already invisible when you cast it. If your invis is about to run out and you're quietly following someone, run into the fog to recast it, otherwise the enemy hero will see a random dust cloud appear at your location.",
      "Like all invis spells, you can cast Shadow Walk while you're channeling a TP.Also like all invis spells, you can pick up, drop, or attack items without losing invis.",
      "Also like all invis spells, you can pick up, drop, or attack items without losing invis.",
      "You can dispel Dust detection (after you walk out of the AoE) with basic dispels, like from Eul's Scepter, Guardian Greaves, Lotus Orb, or Disperser.",
      "If you're prowling around a lane that you think might be sentry warded, try intentionally forcing creep aggro while invis by right clicking an enemy hero anywhere on the map. If the creeps aggro you, then they can obviously see you.",
      "Be sure to save Shadow Walk's cooldown for near the end of a gank. If you use it immediately, the enemy will just be able to TP out because you have no more stuns.",
      "Casting Track doesn't break Shadow Walk invisibility.",
      "Casting Agh's Shard Friendly Shadow doesn't break Shadow Walk invisibility, can be cast while channeling, and Bounty Hunter doesn't have to turn to cast it.",
      "Hover over the Track debuff icon on an enemy to see how much gold they have. You can alt-click the debuff to announce it to your teammates.",
      "You can earn Track gold off Aegis and Wraith King Reincarnation deaths."
    ],
    "counter_tips": [
      "Eul's, Guardian Greaves, Lotus Orb, Manta Style, Satanic, and Disperser can all dispel Track. Allied targeted dispels like Abaddon's Aphotic Shield, Legion Commander's Press the Attack, and Oracle's Fortune's End also work.",
      "Pay attention to your buff icons when there's a Bounty Hunter on the enemy team. You can't see the giant flare when it's on you, but you can see the Tracked icon in your debuffs.",
      "Watch your courier.Watch the path it takes when it's coming to you, watch the path it takes going back, route it over trees, don't send it over commonly warded cliffs, conduct your business quickly at the secret shop, know when the shield and speed bursts are available, anddon't let Bounty constantly snipe your donkey.",
      "Track gold adds up quickly and is what allows teams with softer carries than yours to wipe you out. Bounties LOVE trades because even though it seems like a 1:1 kill, it's more like a 1.5:1 gold kill.",
      "Bounty Hunter is at his strongest in the mid game when teams are separated and still squishy, so take initiative with detection (Dust or sentry wards). As opposed to other invis heroes like Clinkz or Nyx, Bounty doesn't get any bonus move speed from his Shadow Walk, which makes him easy pickings if you Dust him or if he bumbles into a sentry warded area.",
      "Nyx Assassin's Nyxth Sense innate gives him true sight of invisible enemies near his hero which may catch you unawares while you're Shadow Walking."
    ]
  }
}