{
  "name": "Brewmaster",
  "safe_name": "brewmaster",
  "strategies": {
    "general_tips": [
      "You always get the Brewed Up buff when casting Cinder Brew, your hero does not need to be in the target AoE.Dealing any magic damage extends the duration on your own Cinder Brew Brewed Up buff. This includes damage from items, like Blood Grenade or Urn. Or even Midas. You can Midas a creep that's covered in Cinder Brew to extend the Brewed Up buff.Because the \"Roll out the Barrel\" facet makes Cinder Brew itself deal damage, it immediately adds to the Brewed Up buff duration if the barrel hits an enemy.Your hero receiving any magic damagealsoextends the Brewed Up buff.",
      "Dealing any magic damage extends the duration on your own Cinder Brew Brewed Up buff. This includes damage from items, like Blood Grenade or Urn. Or even Midas. You can Midas a creep that's covered in Cinder Brew to extend the Brewed Up buff.",
      "Because the \"Roll out the Barrel\" facet makes Cinder Brew itself deal damage, it immediately adds to the Brewed Up buff duration if the barrel hits an enemy.",
      "Your hero receiving any magic damagealsoextends the Brewed Up buff.",
      "Know that critical attacks always roll during the beginning of an attack animation. You can't swap into Fire Brawler stance and get the crit mid-attack animation.However, slowing effects are applied on attack impact. So if you wanna get real sweaty, you can swap out of Fire Brawler after an attackstartsand into Void Brawler to also get the slow on impact.",
      "However, slowing effects are applied on attack impact. So if you wanna get real sweaty, you can swap out of Fire Brawler after an attackstartsand into Void Brawler to also get the slow on impact.",
      "Any auras that your hero has will be carried through to your primary Split Brewling. The primary Split Brewling order goes from Earth → Storm → Fire → Void as each one dies. The primary Split Brewling's location is also where your hero will return to when the ult ends.With Agh's Shard, canceling Split early will bring your hero back to whichever the primary Split Brewling is.",
      "With Agh's Shard, canceling Split early will bring your hero back to whichever the primary Split Brewling is.",
      "The Earth Brewling's Demolish passive deals extra damage to structures.Remember that most buffs can be applied to your Brewlings. Invoker's Alacrity, Ogre Magi's Bloodlust, or Solar Crest can be great for pushing with the Earth Brewling.",
      "Remember that most buffs can be applied to your Brewlings. Invoker's Alacrity, Ogre Magi's Bloodlust, or Solar Crest can be great for pushing with the Earth Brewling.",
      "I don't care what the situation is, the Cyclone on the Storm Brewling will always be useful. Cyclone a support so that your teammates won't waste time killing that squishy Crystal Maiden when they should be focusing the carry. Cyclone that Omniknight so his whole team cries at him for not ulting. Cyclone that Phantom Assassin who is slicing everyone to shreds because the rest of her team is locking your allies down. Cyclone the roided up Sven and waste a bunch of his God's Strength duration. Then, when he comes back down, wait a few seconds for it to come off cooldown and Cyclone his punk ass again.The Storm Brewling's Cyclone lasts extra long against \"non-hero\" creeps/summons. This isn't really useful for anything other than maybe annoying a Chen.",
      "The Storm Brewling's Cyclone lasts extra long against \"non-hero\" creeps/summons. This isn't really useful for anything other than maybe annoying a Chen.",
      "The Storm Brewling's Cyclone lasts the full duration even if Primal Split ends.",
      "Casting the Storm Brewling's Dispel Magic on the Cyclone will immediately cancel it. Don't stand around watching the enemy spin for the full Cyclone duration if your team is ready to kill them, just end it early.Dispel Magic can also end an enemy self-Eul's.",
      "Dispel Magic can also end an enemy self-Eul's.",
      "Dispel Magic deals a ton of damage to summoned units in the AoE.There are a few exceptions. The following unitsdon'ttake damage from Dispel Magic: Lone Druid's Spirit Bear (other creep-heroesdotake damage, only the Bear doesn't), clones (ex: Meepos, Arc Warden's Tempest Double), Undying's Tombstone zombies, and ward-type units (ex: Pugna's Nether Ward, Shadow Shaman's Serpent Wards)Heroes with a lot of summons like Broodmother's Spiderlings, Enigma's Eidolons, Nature's Prophet's Treants, or Wraith King's Skeletons can also have their armies instagibbed by Dispel Magic.Neutral creepsdo notcount as summons. So dominated or Chen/Enchantress creeps won't take damage.Illusionsdocount as summons. Keep this mechanic in mind if you're against heroes like Naga Siren, Phantom Lancer, or Terrorblade. Dispel Magic even deals full damage to 'strong' illusions.",
      "There are a few exceptions. The following unitsdon'ttake damage from Dispel Magic: Lone Druid's Spirit Bear (other creep-heroesdotake damage, only the Bear doesn't), clones (ex: Meepos, Arc Warden's Tempest Double), Undying's Tombstone zombies, and ward-type units (ex: Pugna's Nether Ward, Shadow Shaman's Serpent Wards)",
      "Heroes with a lot of summons like Broodmother's Spiderlings, Enigma's Eidolons, Nature's Prophet's Treants, or Wraith King's Skeletons can also have their armies instagibbed by Dispel Magic.",
      "Neutral creepsdo notcount as summons. So dominated or Chen/Enchantress creeps won't take damage.",
      "Illusionsdocount as summons. Keep this mechanic in mind if you're against heroes like Naga Siren, Phantom Lancer, or Terrorblade. Dispel Magic even deals full damage to 'strong' illusions.",
      "Dispel Magic is also, obviously, a weak/basic dispel. The dispel works on all enemies and allies in the AoE. So in addition to removing buffs off enemies, you can also remove things like silences, roots, or slows off your allies.",
      "Attacks during the fade time of the Storm Brewling's Wind Walk apply the bonus damage without losing the buff. So technically, you could get 2 Wind Walk damage hits in a single Wind Walk cast. It's fairly easy to do, just make sure you're in range of the enemy you're attacking, cast the Wind Walk, and then immediately right click the enemy. The first attack will land with bonus damage without removing your invisibility.",
      "The Wind Walk also gives a move speed increase on the Storm Brewling. Use it if you're trying to catch an escaping enemy. Once you catch up, cast the Cyclone.",
      "Late game, Wind Walk will be your main escape mechanism because your Fire Brewling will go down as soon as someone so much as farts on it, and the Earth Brewling goes down surprisingly quickly once carries start doling out big single target damage.",
      "Mechanically, the Void Brewling Astral Pull follows the same rules as Force Staff.This means it can be cast on rooted/leashed allies to save them, but can't Pull people out of things like Disruptor's Kinetic Field or Faceless Void's Chronosphere and the Pull gets canceled by Nullifier.",
      "This means it can be cast on rooted/leashed allies to save them, but can't Pull people out of things like Disruptor's Kinetic Field or Faceless Void's Chronosphere and the Pull gets canceled by Nullifier.",
      "You can use the Void Brewling Astral Pull on other Brewlings. Handy if you need to get your Storm Brewling into range for a Cyclone or to Pull the Earth Brewling out of a bad position before your ult ends.",
      "The Void Brewling can self-cast Astral Pull. In most situations this is usually just a targeting nuisance, but you could use it send the Void Brewling itself on to a cliff during a team fight for vision.Don't forget, you can also use Astral Pull to cliff enemies. The Pull always goes the full distance, so make sure the enemy is max Pull range away from a cliff before casting it.",
      "Don't forget, you can also use Astral Pull to cliff enemies. The Pull always goes the full distance, so make sure the enemy is max Pull range away from a cliff before casting it.",
      "Often times you'll be finishing your Primal Split only to have the entire enemy team staring hungrily at your Earth Brewling, waiting for your return. If you have a Blink Dagger, position your Earth Brewling where you can get an effective Blink, and start mashing the item hotkey. Just be sure to turn the Spirit to face the direction you want to Blink in before Primal Split ends. This will avoid any turn animation delay since Brewmaster faces the same direction that the Spirit was last facing.",
      "In high ground siege situations, you can consider sacrificing your Earth Brewling into the enemy fountain after your Storm Brewling has already made a break for it to guarantee that you'll respawn in your Storm Brewling.",
      "Brewling attacks count the same as illusions when calculating damage against ward-type units that require a fixed number of attacks to kill (ex: Pugna's Nether Ward, Shadow Shaman's Serpent Wards), which is usually half damage.",
      "If you take any talent/spell point that 'upgrades' your Brewlings, you will have to resummon your Agh's Scepter Primal Companion for it to receive the updated stats."
    ],
    "counter_tips": [
      "Kill the Fire Brewling ASAP in the early game. It's very squishy, but deals the majority of damage in Primal Split.",
      "You can left click the Spirits and check their buffs to see how much time is remaining on the Split. This is relevant if you're trying to drop some damage/disables on the Earth Brewling to disable Brewmaster's Blink as he returns. You can alt+click the buff to announce the time left in chat for your team.",
      "SILENSILSILSILESILENSILENCESILENCE.Dude hates silences and hexes. Primal Split has a cast time and hexes and some silences are instant. If you have these on your team he'll likely have to cut his Blink → Cinder Brew → Thunder Clap → Primal Split combo to just Blink → Primal Split.",
      "It's worth taking the time to kill his Agh's Scepter Primal Companions if it's convenient. He can't resummon one for a long time if you successfully kill it."
    ]
  }
}