{
  "name": "Clinkz",
  "safe_name": "clinkz",
  "strategies": {
    "general_tips": [
      "Tar Bomb can be cast on buildings.",
      "You can cast Death Pact on your Skeleton Archers.",
      "You can cast Death Pact on creeps protected by Glyph or Roshan's banner.",
      "For some reason you can Death Pact wards you own. Consider keeping a sentry ward in your inventory for a quick snack if you desperately need access to HP.",
      "Chen Persuaded/Enchantress Enchanted allied Hellbears are especially nice to Death Pact in a team fight since they'll give their death aura when you eat them.",
      "Skeleton Archers' attacks match the range of Clinkz and the damage changes dynamically to match a percentage Clinkz's own right click damage.",
      "Skeleton Archers benefit from Tar Bomb, but their attacks do not apply any other attack modifiers that your hero has.Skeleton Archers benefit from the \"Tar Bomb Multishot\" talent.",
      "Skeleton Archers benefit from the \"Tar Bomb Multishot\" talent.",
      "Skeleton Archers always spawn directly to the left and right of wherever your hero is facing when you exit Skeleton Walk. You can try to strategically spawn skellies on cliffs to take advantage of their 800 day/night vision.",
      "Similar to most other invis skills, you can cast Skeleton Walk while channeling, like during a TP.However,unlikemost other invis skills, Clinkz can cast Strafe and Death Pact during Skeleton Walk and itwon'tend the invisibility.",
      "However,unlikemost other invis skills, Clinkz can cast Strafe and Death Pact during Skeleton Walk and itwon'tend the invisibility.",
      "Try to time your ganks so that if things go wrong, Skeleton Walk is already off cooldown.",
      "Agh's Shard Burning Barrage arrows briefly provide flying vision over their projectiles. You can use this to help get vision of a cliff for dewarding.",
      "Agh's Shard Burning Barrage arrows have true strike, apply all attack modifiers, and deal damage even if your hero is disarmed."
    ],
    "counter_tips": [
      "The Strafe buff can be dispelled off Clinkz, but his Skeleton Archers will still keep the buff.",
      "Dust is somewhat useful against Clinkz, but sentry wards are much better. Clinkz gets bonus move speed when he's Skelly Walkin', which makes him hard to catch with or without detection. The goal is to catch him off guard and take the offensive.",
      "Consider keeping your own sentries if you're a carry and Clinkz is starting to roam. You can't depend on your supports to follow you around constantly with detection.",
      "A ground targeted Gleipnir can catch and reveal invisible enemies.",
      "Get a Ghost Scepter if you're a support. It will save your life versus this spooky archer.",
      "Damage block doesnotmitigate damage from Skeleton Archers since the Skeletons are classified as ward-type units and damage block doesn't work on wards.",
      "Nyx Assassin's Nyxth Sense innate gives him true sight of invisible enemies near his hero which may catch you unawares while you're Skeleton Walking."
    ]
  }
}