{
  "name": "Dark Seer",
  "safe_name": "dark_seer",
  "strategies": {
    "general_tips": [
      "Illusions of heroes count to increase your move speed with the \"Heart of Battle\" facet.",
      "Enemies in fog will increase your move speed with the \"Heart of Battle\" facet. Keep an eye on your move speed when going for ganks and you may be able to detect somebody in your vicinity.",
      "Vacuum can move invulnerable/sleeping targets. This means you can pull enemies like a Storm Spirit in Ball Lightning or ones that are slept from Naga Song.",
      "Vacuum can't pull enemies out of a Eul's cyclone, but bizarrely, youcanpull them out of a Wind Waker cyclone, Invoker Tornado, and Brewmaster Storm Brewling Cyclone.",
      "Vacuum destroys trees in a small AoE around the target point.",
      "If the enemy has spells that can quickly kill your creeps or dispel Ion Shell in the laning phase, cast the spell ontheircreeps instead. Place one on the enemy melee creep tanking the least aggro from your creeps to get the most damage.",
      "For some reason you can cast Ion Shell on enemy heroes. The main use for this would be casting it on enemy melee heroes during tower defenses. They'll either kill their whole creep wave or they'll have to back off attacking the tower.You could also cast Ion Shell on an enemy to pop their Linken's Sphere.",
      "You could also cast Ion Shell on an enemy to pop their Linken's Sphere.",
      "Don't put Ion Shells on frontline creeps. You want to put it on the 2nd/3rd creep in the wave whenever you're pushing or farming. The first creep in the wave is going to tank the most damage from the enemy wave and will die first.",
      "Ion Shelling invisible allies is hilarious. The damage isn't large enough to show a huge white bar of missing HP building up on an unsuspecting enemy and the purple lines emitting from the Shell don't even appear.",
      "You can put Ion Shell on your allies and have them stand on neutral creeps to farm them for you.A few tips to make this strategy even more reliable: Neutral creeps will only aggro your hero if you're dealing damage to them within 1800 range. If it's night time and the neutral creeps are sleeping, your ally can stand on neutrals without them freaking out. They'll just sit there and die in their sleep.This also works at day time, but your ally will need to be Smoked and you'll still need to be further than 1800 range away from the creeps.",
      "A few tips to make this strategy even more reliable: Neutral creeps will only aggro your hero if you're dealing damage to them within 1800 range. If it's night time and the neutral creeps are sleeping, your ally can stand on neutrals without them freaking out. They'll just sit there and die in their sleep.",
      "This also works at day time, but your ally will need to be Smoked and you'll still need to be further than 1800 range away from the creeps.",
      "You can cast Ion Shell on creep-heroes like Brewmaster's Brewlings, Lone Druid's Spirit Bear, Visage's Familiars, or Warlock's Golem.",
      "A lot of the time, your allies will benefit from a Surge more than you can. Don't be a scrooge. Surge and Shell your allied Doom to help him catch up to an enemy. Help Crystal Maiden put that ward down without being hassled for once. Let Batrider Lasso drag someone miles away from their team. Watch Spirit Breaker zoom across the entire map in a matter of seconds.",
      "Don't hesitate to cast Wall of Replica in a 1v1 laning phase situation. It's not the illusion damage that you need, it's having an extra controllable unit that you can put an Ion Shell on that makes it a threat.",
      "A Wall of Replica across the top of the stairs on a tier 3 tower can instantly discourage a push. I know it feels bad that you won't be able to make copies if the enemy decides not to push, but if you know that you're not going to get good positioning or a good Vacuum, it can be worth it.",
      "Micro the illusions generated by Wall of Replica. I don't know what their default command is when they're created, but I'm guessing it's something along the lines of:\"Attack useless things.\"As soon as you score a good Vacuum+Wall, order all the units to attack the highest priority target on the enemy team or get them to bully a support out of a fight.",
      "Wall of Replica illusions carry auras just like all other illusions. Sometimes an offlane/support hero on the enemy team is more valuable for their aura rather than trying to get a Replica of the enemy carry.",
      "Wall of Replica can create illusions of invulnerable (but not hidden/banished) heroes. This can be useful against a Juggernaut who is solo Omnislashing you or to make illusions of heroes slept by Naga Song."
    ],
    "counter_tips": [
      "In the early game, as soon as Dark Seer sticks an Ion Shell on a creep, his most powerful offensive spell is on cooldown. Get more aggressive with harassing him when he uses Ion Shell on something other than himself and don't draw aggro from his Ion Shelled creep.",
      "You can dispel Ion Shell. This makes Oracle with Fortune's End or Enchantress with Enchant strong lane counters to DS.Enchantress can also steal Wall of Replica illusions making her especially annoying for Dark Seer to deal with.",
      "Enchantress can also steal Wall of Replica illusions making her especially annoying for Dark Seer to deal with.",
      "You can dispel Surge. This includes dispels from cyclones (like Eul's Scepter or Invoker's Tornado).",
      "When attempting to kill Seer, try to save stuns and disables for AFTER he casts Surge to waste some of the Surge duration.",
      "If you're a carry, pay attention to when an illusion is made of you. While you're critting their team for buckets o' damage, your Bizarro counterpart is doing the same to your supports. Do your team a favor and kill your illusion before it zones them out.",
      "If you have a Radiance, consider toggling it off if you anticipate enemy initiation for a team fight. After you pass through DS's Wall, you can turn it back on.",
      "A Boots of Bearing can help your team quickly scatter if you all got Vacuum'd and slowed by Wall.",
      "Mjollnir's Static Shield active has a chance to proc off any damage instance applied to your hero. This includes damage instances from spells. Since Ion Shell ticks damage extremely frequently, it can be a sneaky way to deal damage against Dark Seer lineups."
    ]
  }
}