{
  "name": "Dawnbreaker",
  "safe_name": "dawnbreaker",
  "strategies": {
    "general_tips": [
      "Your Break of Dawn innate makes you more powerful right as the map transitions to daytime.",
      "If you want to be extremely annoying in lane, cancel the Starbreaker cast animation to mindgame enemies and bait them into getting complacent about dodging it. Be warned, however, you have to have quick fingers to cancel the animation.",
      "Dawnbreaker will destroy trees as her hero moves into them during Starbreaker.",
      "You do not have free pathing in Starbreaker, so you can't travel up or down cliffs during the spell.",
      "If you have the \"Double Tap Ability to Self Cast\" setting enabled, double tapping Starbreaker will cast the spell directly in front of where you're facing.",
      "On-hit effects (like Basher, Maelstrom, or Desolator) will apply normally during Starbreaker attack swipes except for cleave.Echo Sabre will apply its slow and be put on cooldown after the first swipe. Unfortunately, Starbreaker is already a 100% slow, so in reality the Echo Sabre proc is just wasted.Activating a Shadow Blade/Silver Edge will give you the backstab bonus, but also remove the invisibility as soon as a swipe connects on an enemy. If multiple heroes are hit during the same swipe, you'll only backstab the first hero you connect with.Quelling Blade damage does apply on creeps during Starbreaker.",
      "Echo Sabre will apply its slow and be put on cooldown after the first swipe. Unfortunately, Starbreaker is already a 100% slow, so in reality the Echo Sabre proc is just wasted.",
      "Activating a Shadow Blade/Silver Edge will give you the backstab bonus, but also remove the invisibility as soon as a swipe connects on an enemy. If multiple heroes are hit during the same swipe, you'll only backstab the first hero you connect with.",
      "Quelling Blade damage does apply on creeps during Starbreaker.",
      "You can cast items normally during Starbreaker. However, targeted items need to have their cast location be in front of you during the spell because Dawn can't turn during Starbreaker.You can cast Force Staff or Harpoon mid-Starbreaker to get some forward movement while spinning.After the initial swipes go off, you can Blink Dagger forwards to instantly land on a target with the final swipe stun to surprise an enemy.You can technically initiate a TP mid-Starbreaker if you're facing your TP location, but it won't complete because Dawnbreaker ministuns herself after the final swipe. That applies to all channeled spells/items cast during Starbreaker.",
      "You can cast Force Staff or Harpoon mid-Starbreaker to get some forward movement while spinning.",
      "After the initial swipes go off, you can Blink Dagger forwards to instantly land on a target with the final swipe stun to surprise an enemy.",
      "You can technically initiate a TP mid-Starbreaker if you're facing your TP location, but it won't complete because Dawnbreaker ministuns herself after the final swipe. That applies to all channeled spells/items cast during Starbreaker.",
      "Starbreaker attack swipes ignore disarms and have true strike.",
      "Illusions hit by Starbreaker with the \"Starsurge\" facet count as heroes to build up attack speed stacks.",
      "Despite providing debuff immunity, Agh's Shard Starbreakerdoes notapply a dispel on your hero.",
      "Debuff immunity ends if Agh's Shard Starbreaker gets interrupted.",
      "A side product of Agh's Shard giving you free movement during Starbreaker is that move speed buffs can make you faster during swipes.",
      "Note that free movement is not the same thing as free pathing. Agh's Shard Starbreaker does not allow you to traverse cliffs or move past obstacles.",
      "Luminosity can only gain one charge per Starbreaker swipe regardless of how many enemies get hit.",
      "While Celestial Hammer is out, you cannot cast Starbreaker.",
      "Celestial Hammer very briefly provides a small radius of vision where it lands, but not while the Hammer is flying.",
      "Celestial Hammer destroys trees in its path when flying or returning to Dawnbreaker.",
      "Celestial Hammer can damage enemies once while flying towards the destination and once again upon returning.",
      "No matter how far the Celestial Hammer is, Dawnbreaker will only travel a maximum distance of the Hammer's cast range when Converging to it.",
      "Be aware that you can use Coverge with Celestial Hammer to travel up and down cliffs when initiating or escaping.",
      "You can use Converge to escape a Disruptor's Kinetic Field.",
      "Luminosity is considered lifesteal, not healing. So Holy Locket heal amp does not increase the HP gain, but lifesteal amp from Sange does.This includes the Luminosity AoE 'heal' on allies. That value is also calculated from how much you lifestealed.",
      "This includes the Luminosity AoE 'heal' on allies. That value is also calculated from how much you lifestealed.",
      "You ideally want the first Starbreaker swipe to proc Luminosity so that the other swipes will quickly build up stacks again. Then you'll potentially get another Luminosity auto attack while they're stunned.",
      "Every target hit in a Starbreaker swipe will proc Luminosity once it's charged. If you're trying to burst heal, gather as many units as possible so you get an AoE Luminosity from a Starbreaker swipe.",
      "Luminosity stacks last indefinitely and won't increase/proc when attacking buildings or ward targets.",
      "You can hold ALT to see all your allies current HP under their top bar portraits. Useful if you want to keep your camera away from a fight, but want to make sure you can time Solar Guardian on an ally if they're about to die.You can even cast Solar Guardian on an ally by clicking their top bar portrait when targeting the spell.",
      "You can even cast Solar Guardian on an ally by clicking their top bar portrait when targeting the spell.",
      "You can cast Solar Guardian on yourself.",
      "You cannot cast Solar Guardian on allies that are banished, but you can cast it on allies that are cycloned.",
      "You can cast Solar Guardian on creep-heroes like Lone Druid's Spirit Bear, Visage's Familiars, or Warlock's Golem. Technically, Elder Titan's Astral Spirit is also classed as a creep-hero but the cowards at Valve won't let you to cast Guardian on it.",
      "Once you're in the air during Solar Guardian, you're completely banished off the map. You can't receive buffs or debuffs until you land.",
      "Solar Guardian's stun works on debuff immune/BKB'd enemies.",
      "Dawnbreaker will always get the landing stun from Solar Guardian. Even if you're going to land inside an Enigma Black Hole or Faceless Void Chronosphere, you'll always land with the stun first.",
      "Dawnbreaker's actual hero moves locations around the midpoint of a Solar Guardian cast. This is relevant if you have auras on your hero, because the auras won't be centered around the Solar Guardian AoE until your hero moves halfway through the cast.",
      "If you're trying to escape, bear in mind that Solar Guardian's cast time is quicker than channeling a TP."
    ],
    "counter_tips": [
      "Dawnbreaker's Break of Dawn innate makes her more powerful right as the map transitions to daytime.",
      "The best way to deal with Starbreaker in lane is to just walk into her. It seems counterintuitive, but you're better off avoiding the spell by moving closer to her rather than running away.",
      "Silences cannot cancel a Starbreaker that is already in progress. Every other type of disable (stuns, sleeps, fears, etc) can, though.",
      "You can cancel Dawnbreaker's Converge to her Hammer by stunning, cycloning, fearing, or applying any forced movement/knockback to her mid-flight.",
      "Roots/leashes can prevent Dawnbreaker from casting Converge, but they won't stop her if she's already flying to her Hammer.",
      "Nyx Assassin can just walk into a Solar Guardian, activate Carapace, and immediately make Dawnbreaker very sad.",
      "Silencer can cast Global Silence on reaction to interrupt a Solar Guardian, but be aware that if you're too slow and she's already in the air, she's completely invulnerable and is going to land unsilenced.",
      "The HP Dawnbreaker's allies heal from Solar Guardian can be reduced by debuffs that affect Health Restoration:Items that can reduce health restoration: Spirit Vessel, Orb of Frost/Corrosion, Skadi, Shiva's Guard, and the \"Crippling Crossbow\" and \"Jidi Pollen Bag\" neutral item artifacts.Spells that can reduce health restoration: Ancient Apparition's Ice Blast, Broodmother's Spin Webs with \"Necrotic Webs\" facet, Doom's Doom, Dragon Knight's \"Frost Dragon\" facet, Drow Ranger's Agh's Scepter Hypothermia, anda few others.",
      "Items that can reduce health restoration: Spirit Vessel, Orb of Frost/Corrosion, Skadi, Shiva's Guard, and the \"Crippling Crossbow\" and \"Jidi Pollen Bag\" neutral item artifacts.",
      "Spells that can reduce health restoration: Ancient Apparition's Ice Blast, Broodmother's Spin Webs with \"Necrotic Webs\" facet, Doom's Doom, Dragon Knight's \"Frost Dragon\" facet, Drow Ranger's Agh's Scepter Hypothermia, anda few others."
    ]
  }
}