{
  "name": "Disruptor",
  "safe_name": "disruptor",
  "strategies": {
    "general_tips": [
      "With the \"Thunderstorm\" facet, Thunder Strike will affect enemies within the Kinetic Field even if the primary Thunder Strike target isn't in the Field.",
      "If you ground target Agh's Shard Thunder Strike, you can bypass enemy Linken's Spheres and Lotus Orbs.",
      "If you ground target Agh's Shard Thunder Strike from fog, you won't reveal yourself to the enemy who gets hit by it. If you directly target them, they'll get vision of you.This is true for any spell that has the option between ground and direct unit targeting. If you ever directly target an enemy unit, the enemy team will briefly get vision of your hero. If you ground target, you won't be revealed through fog.",
      "This is true for any spell that has the option between ground and direct unit targeting. If you ever directly target an enemy unit, the enemy team will briefly get vision of your hero. If you ground target, you won't be revealed through fog.",
      "Count down your Glimpses. Glimpse is an incredibly powerful spell, but only if used intelligently. Glimpse will always revert someone to where they were 4 seconds prior. So as soon as you see someone out of position, remember where they were and start counting to four. Watch where the end location dot is and cast a Field around it.One method to timing Glimpses is by casting a Thunder Strike on your target. The third Strike connects four seconds after the spell was cast. Plus, Thunder Strike gives you vision of your target.",
      "One method to timing Glimpses is by casting a Thunder Strike on your target. The third Strike connects four seconds after the spell was cast. Plus, Thunder Strike gives you vision of your target.",
      "Glimpse will break any enemy channels on cast.",
      "Glimpse instantly kills illusions, but not 'strong' illusions.",
      "If you Glimpse a freshly spawned Arc Warden Tempest Double, it'll immediately get sent back to Arc Warden's fountain since it was spending time \"dead\" there.",
      "If you Glimpse a freshly spawned Warlock Golem, it'll immediately get sent to the very middle of the map (Dire's mid lane river high ground). Why? Because.",
      "Same thing happens if you Glimpse a freshly spawned or freshly leveled-up Lone Druid Spirit Bear.",
      "Try getting wards/vision behind towers when pushing. Players will often TP to the rear of a tower and linger there for >4 seconds so they don't get insta-Glimpsed. Spot them and send then from whence they came.",
      "Kinetic Field provides vision inside the circle, allowing you to scout Rosh, trees, or high ground from long range. This is also useful for dewarding cliffs.Only the inside of Kinetic Field provides vision. The areas near the wall donotprovide vision. If an enemy is pushing up against the Kinetic Field wall, you won't be able to see them.Kinetic Fence does not provide any vision.",
      "Only the inside of Kinetic Field provides vision. The areas near the wall donotprovide vision. If an enemy is pushing up against the Kinetic Field wall, you won't be able to see them.",
      "Kinetic Fence does not provide any vision.",
      "The outside of Kinetic Field is just as useful as the inside. Don't be afraid to block someone on the outside with the edge rather than lock them in.",
      "Allies with spells that apply forced movement or knockback, like Drow Ranger's Gust, Mars's Spear, or Windranger's Agh's Shard Gale Force, can potentially push enemies out of your Kinetic Field.",
      "Nearly all mechanic interactions with Kinetic Field are identical to Kinetic Fence.",
      "Agh's Scepter Static Storm 'mutes' enemies which prevents usage of any item, including TP. Mutes even cancel TPs that are mid-channel.",
      "Agh's Scepter Static Storm can mute enemies who are invulnerable/cycloned. However, heroes who are hidden/banished will not be muted and they will be able to activate items/spells upon emerging from the banish."
    ],
    "counter_tips": [
      "TP behind trees or even one tier back if you're defending a push against Disruptor unless you like wasting gold and getting sent back to base by Glimpse. Glimpse will also be a real pain if you're Dawnbreaker (Solar Guardian), Io (Relocate), Nature's Prophet (Teleportation), Spectre (Shadow Step), or Tinker.",
      "Pay attention to the AoE of the Static Storm. Often times Disruptors will cast half of it within the Kinetic Field and the other half outside. Stop running against the wall of the Field and sitting in the Storm if you don't have to.",
      "Kinetic Field provides vision in the middle of the Field, but not actually around the wall. If you're trying to escape in trees and you see a Field forming, you're actually the least visible if you touch the wall.",
      "Many spells that provideforced movementcan allow a hero to move through a Field.Some forced movementdoes notlet you pass through Kinetic Field.Force Staff/Hurricane Pike/Harpoon are the main examples, but the following spells also don't get you out of Kinetic Field: Dawnbreaker's Starbreaker, Magnus's Skewer, Mirana's Leap, Monkey King's Tree Dance or Primal Spring, Phoenix's Sun Ray, Primal Beast's Onslaught, Slark's Pounce, and Snapfire's Firesnap Cookie don't work.Spirit Breaker's Charge makes literally no sense. Sometimes it goes Kinetic Field, sometimes he gets stuck on the edge. I can find literally no consistency whatsoever on the rules the cow follows.",
      "Some forced movementdoes notlet you pass through Kinetic Field.Force Staff/Hurricane Pike/Harpoon are the main examples, but the following spells also don't get you out of Kinetic Field: Dawnbreaker's Starbreaker, Magnus's Skewer, Mirana's Leap, Monkey King's Tree Dance or Primal Spring, Phoenix's Sun Ray, Primal Beast's Onslaught, Slark's Pounce, and Snapfire's Firesnap Cookie don't work.",
      "Spirit Breaker's Charge makes literally no sense. Sometimes it goes Kinetic Field, sometimes he gets stuck on the edge. I can find literally no consistency whatsoever on the rules the cow follows.",
      "Spells that provide flying movement or unobstructed movement donotallow a hero to pass through Kinetic Field.",
      "Planting an Iron Branch can let you escape a Kinetic Field. To perform this trick, get your hero to push against the edge of the Field, then either portrait cast Branch or cast the Branch behind your hero, but inside your hero's white selection circle.The resulting tree may shove you out of the Field.This trick also works against Slark's Pounce leash.The reason Iron Branch can push you out of a Kinetic Field is because the tree has collision. That means spells that create collision, like Tusk's Ice Shards, Nature's Prophet's Sprout, or a well angled Earthshaker Fissure, can also push a hero out.",
      "The reason Iron Branch can push you out of a Kinetic Field is because the tree has collision. That means spells that create collision, like Tusk's Ice Shards, Nature's Prophet's Sprout, or a well angled Earthshaker Fissure, can also push a hero out.",
      "Other repositioning effects can also provide a Kinetic Field escape. Like getting kicked by an Earth Spirit Boulder Smash, getting Meat Hooked by Pudge, or even a lucky Manta Style rearrangement.Earth Spirit can also Rolling Boulder in/out of a Kinetic Field and can Agh's Shard Geomagnetic Grip allies out.",
      "Earth Spirit can also Rolling Boulder in/out of a Kinetic Field and can Agh's Shard Geomagnetic Grip allies out.",
      "Wind Waker movement can get you out of a Kinetic Field.",
      "Nearly all mechanic interactions with Kinetic Field are identical to the \"Kinetic Fence\" facet.",
      "Debuff immunity or banishes are the only ways to \"dodge\" Glimpses. Eul's Scepter doesn't work (cyclone ends early because you're not hidden/banished while cycloned, you're only invulnerable) and most forced movement spells get canceled by Glimpse.Banishes that can dodge Glimpse include: Lifestealer's Infest, Outworld Destroyer's Astral Imprisonment, Puck's Phase Shift, Shadow Demon's Disruption, Snapfire's Agh's Scepter Gobble Up, and Tusk's Snowball.Manta Style is another very important banish that works against Glimpse. It's tricky, but with enough practice, you should be able to fairly consistently dodge Glimpse with a Manta Style activation.Certain un-interruptable position changing spells like Ember Spirit's Sleight of Fist and Activate Fire Remnant, Phantom Lancer's Doppelganger, Riki's Tricks of the Trade, Sand King's Burrowstrike, Timbersaw's Timber Chain (if the Chain hasn't connected before Glimpse goes off), Void Spirit's Dissimilate, and Necrophos's Agh's Shard Death Seeker can also dodge Glimpse relocation.",
      "Banishes that can dodge Glimpse include: Lifestealer's Infest, Outworld Destroyer's Astral Imprisonment, Puck's Phase Shift, Shadow Demon's Disruption, Snapfire's Agh's Scepter Gobble Up, and Tusk's Snowball.",
      "Manta Style is another very important banish that works against Glimpse. It's tricky, but with enough practice, you should be able to fairly consistently dodge Glimpse with a Manta Style activation.",
      "Certain un-interruptable position changing spells like Ember Spirit's Sleight of Fist and Activate Fire Remnant, Phantom Lancer's Doppelganger, Riki's Tricks of the Trade, Sand King's Burrowstrike, Timbersaw's Timber Chain (if the Chain hasn't connected before Glimpse goes off), Void Spirit's Dissimilate, and Necrophos's Agh's Shard Death Seeker can also dodge Glimpse relocation.",
      "An extremely well timed Harpoon on a target could buy you some space when being Glimpsed. You need to time it so the Harpoon projectile is flying to the target when the Glimpse ends and you'll get yanked slightly in the target's direction after it lands.",
      "A Pipe can save you from the Glimpse+Static Storm combo if you have a Blink Dagger. Putting up the Barrier will eat the Glimpse damage and first few instances of Static Storm damage, potentially buying you enough time to Blink out.",
      "Kunkka is a sleeper counterpick to Disruptor since you can X Marks an ally who's getting Glimpsed to save them from being repositioned.",
      "If Disruptor is spamming Thunder Strike on you in lane, consider standing next to your ranged creep to make it take damage and bring it into deny range."
    ]
  }
}