{
  "name": "Elder Titan",
  "safe_name": "elder_titan",
  "strategies": {
    "general_tips": [
      "If you Echo Stomp while the Spirit isn't out, both the magical and physical damage instances will work off your hero.",
      "Don't start whaling on an enemy as soon as you land the Sleep. Get a better position, let your team get into a better position, then go to town.",
      "Echo Stomped targets will wake up only after they take a certain amount of total damage.",
      "Cast Echo Stomp when the Spirit is on its way back home. Cast the Spirit, step on some fools, then have it walk down the lane so the enemy team will forget about it. Then when it's on the way back, cast Echo Stomp and your Spirit's hips will start moving on their own~. Since the Spirit returns way faster than it walks normally, players won't always react quick enough to dodge it.",
      "If you spam your 'stop' hotkey to cancel Echo Stomp's cast animation when the Spirit is returning, you can slightly extend the time it takes for the Spirit to return to your hero.",
      "There is no difference between casting Echo Stomp from your Spirit or from your hero. However, if your hero is taunted, you can cast Echo Stomp from your Spirit and then both your hero and the Spirit will start channeling the spell. This only works when taunted, not under stuns, silences, sleeps, or fears.",
      "The Spirit walks around as fast as ET is at the time of casting. This means that a Dark Seer Surge'd ET will have a Surge-speed Spirit.This makes Phase Boots surprisingly great on ET since you can activate Phase and then cast Spirit and have it roam around at Phased speeds for its entire duration.",
      "This makes Phase Boots surprisingly great on ET since you can activate Phase and then cast Spirit and have it roam around at Phased speeds for its entire duration.",
      "Natural Order armor reduction aura is centered around the hero, and the magical reduction aura is centered around the Spirit.",
      "Natural Order removesbasearmor and magic resistance, which comes from AGI and INT respectively.",
      "Having your Spirit sit around on enemies in lane just for Natural Order is useless if you're not planning on attacking them any time soon. Have your Spirit go suck up some more damage/farm by sending it into jungle camps rather than sitting around spooning heroes.The Spirit can take Twin Gates. It takes forever for it to come back from its semester abroad, but it may step on a lot of damage on the way back.",
      "The Spirit can take Twin Gates. It takes forever for it to come back from its semester abroad, but it may step on a lot of damage on the way back.",
      "You can use a long-distance Spirit Return to your advantage to set up for kills. Spirit starts cooling down whenever it's cast, not whenever it's Returned. When the Spirit finally returns, start pounding on people with the extra bonus damage and you'll have another Spirit cooldown ready in the chamber to finish them off.",
      "It can be in your benefit to stack neutral camps near your lane so you can gain a lot of damage by running your Spirit over more creeps.",
      "If your hero is within ~1800 range of a neutral camp, you can draw aggro and stack it with Astral Spirit.",
      "Whatever Spirit bonus buffs you have are immediately replaced by new values when returning a new Spirit.",
      "Use the Spirit to scout out fogged areas during pushes or defenses.",
      "During chases, try to pincer your target by casting the Spirit on a choke point. Either they have to run through the whole thing and risk getting Stomped or they have to change directions.",
      "You can right click an enemy when your Spirit is selected to have it follow the target for its duration.",
      "Ideally, you want to cast Earth Splitter as far away from the enemy team as possible to give them the smallest amount of time to react to the crack approaching."
    ],
    "counter_tips": [
      "With shpeed. Elder Titan is a very unwieldy hero. His Stomp is slow, his Spirit is slow, Earth Splitter is slow. If you can move fast and avoid his spells, you can evade a lot of damage that ET should be dealing to you.Along those lines, Force Staff gives you an easy eject button if you're getting comboed into some of his spells.",
      "Along those lines, Force Staff gives you an easy eject button if you're getting comboed into some of his spells.",
      "The Astral Spirit buff can be dispelled off of Elder Titan. This can make heroes like Enchantress with Enchant or Oracle with Fortune's End handy in the laning phase.",
      "Oracle can wake allies up from Echo Stomp with Purifying Flames damage. Pudge can wake himself up with Rot.",
      "Elder Titans will often stack your camps in lane just so they can get more Spirit damage. It sounds crazy, but you should try blocking your own camps to stop him from doing this.",
      "Be aware that glyphs used by Elder Titan's team will be much more powerful thanks to his Tip the Scales innate."
    ]
  }
}