{
  "name": "Enchantress",
  "safe_name": "enchantress",
  "strategies": {
    "general_tips": [
      "Manually casting Impetus on enemy heroes won't draw creep aggro.",
      "Impetus calculates the damage by the distance between you and the target once the projectile hits the target. There's a cap at 1750 distance.",
      "Impetus deals bonus damage to illusions.",
      "You can Enchant nearly every enemy/neutral unit including enemy illusions.You can even Enchant Grimstroke's Dark Portrait illusion. Probably a bug, enjoy it while you can.",
      "You can even Enchant Grimstroke's Dark Portrait illusion. Probably a bug, enjoy it while you can.",
      "Only one unit can be Enchanted at a time.If you have Agh's Scepter, you can Enchant two units at a time.",
      "If you have Agh's Scepter, you can Enchant two units at a time.",
      "Enchanted enemy lane creeps will benefit from your Glyph's invulnerability.Enchanted enemy lane creeps also benefit from Roshan's Banner invulnerability. This also works with any Dominated enemy lane creep.",
      "Enchanted enemy lane creeps also benefit from Roshan's Banner invulnerability. This also works with any Dominated enemy lane creep.",
      "When scouring the map for useful creeps to take, consider using your courier for vision and scouting out camps.",
      "If you're looking for comprehensive details on which creeps are useful to Enchant, check theChen page.",
      "Casting Enchant on enemies will dispel them. Here are some buffs worth noting that can be dispelled: Abaddon's Aphotic Shield, Dark Seer's Surge and Ion Shell, Ember Spirit's Flame Guard, Magnus's Empower, Monkey King's Jingu Mastery, Ursa's Overpower, Ghost Scepter, and Haste/Amplify Damage/Arcane/Regen/Shield (but not Invis) runes.",
      "Untouchable makes you a great hero to tank Rosh since he attacks in bullet time.",
      "Agh's Shard Sproink disjoints incoming projectiles.",
      "If you cast Agh's Scepter Little Friends on a debuff immune/BKB'd enemy, they won't get rooted, but creeps will still attack them."
    ],
    "counter_tips": [
      "Impetus damage is calculated as the distance between you and Enchantress when the attack lands. You can walk closer to Ench to reduce the damage you'll take.",
      "The attack speed slow from Enchantress's Untouchable passive can be disabled by Breaks.Breaks can be provided with items like Silver Edge or Khanda. Spells that Break include Hoodwink's Sharpshooter, Naga Siren's Agh's Scepter Ensnare, Phantom Assassin's Agh's Scepter Fan of Knives, Shadow Demon's Agh's Scepter Demonic Purge, Viper's Viper Strike, anda few others.",
      "Breaks can be provided with items like Silver Edge or Khanda. Spells that Break include Hoodwink's Sharpshooter, Naga Siren's Agh's Scepter Ensnare, Phantom Assassin's Agh's Scepter Fan of Knives, Shadow Demon's Agh's Scepter Demonic Purge, Viper's Viper Strike, anda few others.",
      "Debuff immunity/BKB does not bypass Untouchable's attack speed slow.",
      "If you're a right clicker, try to let your supports take care of Bambi. You'll be wasting your time trying to kill her mid game when nukes will touch her Untouchable fluffy tail quicker than you can.",
      "The Untouchable debuff persists through your attack backswings even if you use a move command in between attacks.However,if you initiate an attack on adifferenttarget during the Untouchable backswing, then re-acquire Enchantress as a target, you'll bypass the backswing slow.Put more plainly, to maximize attack speed against Enchantress: Attack her, as soon as the attack connects select a different enemy in range to attack, then immediately click on Enchantress again.This works because the Untouchable debuff is removed as soon as you initiate an attack on a non-Enchantress target.If you still don't understand,here's an ancient video from jmvincento demonstrating the interaction.",
      "Put more plainly, to maximize attack speed against Enchantress: Attack her, as soon as the attack connects select a different enemy in range to attack, then immediately click on Enchantress again.",
      "This works because the Untouchable debuff is removed as soon as you initiate an attack on a non-Enchantress target.",
      "If you still don't understand,here's an ancient video from jmvincento demonstrating the interaction.",
      "Shadow Demon's Agh's Shard Demonic Cleanse is a constant dispel on allies. This means it'll constantly dispel the Untouchable attack speed slow, allowing your carry to beat on Ench like any other hero.",
      "You can \"store\" the max attack speed second hit of an Echo Sabre by canceling the attack before it connects. The attack speed buff lasts indefinitely, so you can spend the first right click on a creep and then use the Echo Sabre buff to go through Untouchable whenever you attack Enchantress.",
      "The HP Enchantress gains from Nature's Attendants can be reduced by debuffs that affect Health Restoration:Items that can reduce health restoration: Spirit Vessel, Orb of Frost/Corrosion, Skadi, Shiva's Guard, and the \"Crippling Crossbow\" and \"Jidi Pollen Bag\" neutral item artifacts.Spells that can reduce health restoration: Ancient Apparition's Ice Blast, Broodmother's Spin Webs with \"Necrotic Webs\" facet, Doom's Doom, Dragon Knight's \"Frost Dragon\" facet, Drow Ranger's Agh's Scepter Hypothermia, anda few others.",
      "Items that can reduce health restoration: Spirit Vessel, Orb of Frost/Corrosion, Skadi, Shiva's Guard, and the \"Crippling Crossbow\" and \"Jidi Pollen Bag\" neutral item artifacts.",
      "Spells that can reduce health restoration: Ancient Apparition's Ice Blast, Broodmother's Spin Webs with \"Necrotic Webs\" facet, Doom's Doom, Dragon Knight's \"Frost Dragon\" facet, Drow Ranger's Agh's Scepter Hypothermia, anda few others.",
      "Dagon's active heals you for a percentage of the damage it deals. Dagon also instakills creeps and the damage it 'deals' is equal to the current HP of the creep when you zap it. It can theoretically be worthwhile to Dagon an Ench creep for a burst heal in a fight.",
      "If you're about to die to a long range Impetus and no enemy heroes are around you, you can activate Smoke and the attack won't connect.",
      "Be aware that jungle camps will hit harder if Enchantress is on the enemy team thanks to her Rabble-Rouser innate."
    ]
  }
}