{
  "name": "Enigma",
  "safe_name": "enigma",
  "strategies": {
    "general_tips": [
      "Self-damage, like from activating Soul Ring or casting Demonic Summoning, counts as damage for the \"Splitting Image\" facet.",
      "All allied units, including your Eidolons, have increased damage resistance when they're standing near your hero thanks to your Gravity Well innate.",
      "Jungle creeps have a tendency to use their spells whenever three units are in close proximity to them. When jungling a neutral camp, spread your Eidolons out so they don't trigger the neutrals to use their spells.",
      "When jungling, be aware that you can drop neutral aggro off of your Eidolons the same way you can drop tower aggro. Select the Eidolon in question and then a+click another allied unit and the creeps should lose interest in that Eidolon.",
      "Attacks on buildings or allied units do not increase the attack counter for Eidolon multiplication.However, if Eidolons only needonemore attack before they multiply, a tower attack will work. I don't know why.",
      "However, if Eidolons only needonemore attack before they multiply, a tower attack will work. I don't know why.",
      "If you target Demonic Summoning on the very edge of a cliff top, you'll usually get a single Eidolon to spawn on the cliff and the other ones will spawn on the ground. Useful for dewarding or keeping vision without having to Cliffteezy all your Eidolons.",
      "Midnight Pulse breaks trees in a massive AoE. Use this to counter Nature's Prophet's Sprout, burn down a bunch of trees during a chase, stun a Tree Dancing Monkey King, or to be super sneaky and carve a path to hide so you can easily Blink in for huge Black Holes.",
      "Midnight Pulse deals full damage against debuff immune/BKB'd enemies.",
      "Midnight Pulse does not deal damage to Roshan.",
      "Multiple instances of Midnight Pulse do not stack.",
      "When going for solo kills with Black Hole in the early game, try to get a few multiplied Eidolons out first to make sure you have enough damage for a kill.",
      "Black Hole is a unique type of stun which also comes with a silence. In most situations, this doesn't really matter, but it does prevent Abaddon from being able to manually activate Borrowed Time or Ursa activating Agh's Scepter Enrage."
    ],
    "counter_tips": [
      "\"Hey guys don't clump, I think Black Hole is off coo... GOD DAMN IT.\"",
      "A few choice heroes that are good at dealing with Black Hole:Beastmaster- Can stand on the other end of a Black Hole and still stun Enigma out of BKB with Primal Roar.Rubick- Can guaranteed Spell Steal Black Hole even through debuff immunity.Silencer- Global Silence cancels Black Hole even through debuff immunity.Treant Protector- Overgrowth can cancel Black Hole even through debuff immunity.Clockwerk- Hookshot is a long range debuff immunity piercing disable.Pudge- Meat Hook is a long range debuff immunity piercing disable.Vengeful Spirit- Nether Swap is a long range debuff immunity piercing disable.Warlock- Chaotic Offering is a long range debuff immunity piercing disable.Winter Wyvern- Winter's Curse is a long range debuff immunity piercing disable.",
      "Beastmaster- Can stand on the other end of a Black Hole and still stun Enigma out of BKB with Primal Roar.",
      "Rubick- Can guaranteed Spell Steal Black Hole even through debuff immunity.",
      "Silencer- Global Silence cancels Black Hole even through debuff immunity.",
      "Treant Protector- Overgrowth can cancel Black Hole even through debuff immunity.",
      "Clockwerk- Hookshot is a long range debuff immunity piercing disable.",
      "Pudge- Meat Hook is a long range debuff immunity piercing disable.",
      "Vengeful Spirit- Nether Swap is a long range debuff immunity piercing disable.",
      "Warlock- Chaotic Offering is a long range debuff immunity piercing disable.",
      "Winter Wyvern- Winter's Curse is a long range debuff immunity piercing disable.",
      "If you don't have any heroes who can break Black Hole, remember that Abyssal Blade's active can stun through debuff immunity as well. Obviously thepassive bashesfrom Basher or Abyssal will work too.",
      "Casting Wind Waker on an ally could potentially save them from certain late game Black Hole deaths."
    ]
  }
}