{
  "name": "Grimstroke",
  "safe_name": "grimstroke",
  "strategies": {
    "general_tips": [
      "The Stroke of Fate projectile provides a small radius of vision as it travels and 2 seconds of lingering vision where it ends.",
      "In lane, try to curve Stroke of Fate through neutral camps to build up damage before hitting an enemy hero. The more creep stacks there are, the more effective this is.Try attacking the enemy first to get your Ink Trail innate vision on them to help know where to aim your 360 noscope Stroke.",
      "Try attacking the enemy first to get your Ink Trail innate vision on them to help know where to aim your 360 noscope Stroke.",
      "Phantom's Embrace pops Linken's Sphere on cast, not on projectile impact.",
      "Casting Phantom's Embrace on a siege creep will make it immediately lose interest in the tower it's attacking and start catapulting the Phantom instead.",
      "When entering a Chronosphere the Phantom's Embrace projectile will pause if it's traveling to a target. If it's latched on to someone inside of a Chronosphere, it automatically flies back and applies the nuke damage. Thus, if you catch an enemy facing into a Chrono, but still on the edge where the Phantom can latch it, you can spam the spell on them.",
      "For some reason, the Phantom's Embrace projectile can't pass through Disruptor's Kinetic Field.",
      "Phantom's Embrace provides shared vision over the target as it's flying and once the projectile lands. That means fog of war around the hero is revealed during the spell's duration.",
      "Ink Swell can be cast on allied creeps and summons. This also includes allied couriers, so you can actually send an Ink Swelled courier in to potentially stun a target from out of nowhere.",
      "Enemies won't see any visual of the tendrils damaging them if the Ink Swelled target is invisible.",
      "Ink Swell will work normally even if the ally it's on is banished, however none of the particle effects will be visible.",
      "Soulbind's leash can cancel TPs (and other channels), even through debuff immunity/BKB, but only if the target is actually bound to something else. No bind, no leash, no cancel.",
      "Soulbind provides shared vision and true sight for all targets that are affected, even if a hero is not linked to anything else.",
      "Soulbind can target and connect to creep-heroes, like Lone Druid's Spirit Bear, Visage's Familiars, and Warlock's Golem.",
      "Soulbind cannot link a primary target to illusions or invisible heroes.As a result, if an illusion is the primary target, the Soulbind will always select a real hero out of the bunch because it can never link to another illusion.",
      "As a result, if an illusion is the primary target, the Soulbind will always select a real hero out of the bunch because it can never link to another illusion.",
      "There is a way to get two Agh's Scepter Dark Portrait illusions of the same hero, but the procedure is a little convoluted. You need to target Soulbind on anillusionof a hero and link it to their real hero. Then you need to cast Dark Portrait on thereal hero.If you do this in any other order, you won't get two Dark Portraits.",
      "Linken's Sphere can block Soulbind for the primary target, but Lotus Orb has no effect on Soulbind. Cast it on a Lotus'd target without fear of it being reflected.",
      "Soulbind is a wacky spell. Mechanically, think of it like you're putting a Lotus Orb on an enemy, except anything that would get reflected will actually be cast again targeting the other bound hero. That being said, here are the answers to a few burning questions you may have always been curious about:Axe's Culling Blade will only give your cooldown back if the primary target is successfully Culled.Chaos Knight's Reality Rift will suck both targets in towards you.Kunkka's X will connect on both heroes, but casting the Return will only bring back the primary target.Legion Commander will quite literally 2v1 in a Duel. You'll get Duel damage for each target that dies. If you die, they'll both get damage. If the primary target dies, you'll move on to the secondary target for however much time is left. I have absolutely no clue how the primary target is chosen, I can't find any logic to it.Nature's Prophet's Wrath of Nature will only double up if you directly cast it on one of the targets, not if you ground target it.Oracle will start channeling another Fortune's End after the first one connects, but you won't see the channel bar on your HUD and you need to be standing still before the second channel starts.Primal Beast's Pulverize will fully stun both targets, but only the primary target will generate AoE smashing stuns. The secondary target will get teleported in front of Primal when Pulverize ends.Riki's Blink Strike will damage both heroes, but he'll end up on the primary target.Sniper will target the primary hero with Assassinate and then immediately shoot another projectile at the secondary target once the first connects.Tiny will attempt to Toss two units simultaneously at both targets.Terrorblade will Sunder the primary target's HP, the primary gets the secondary's HP, and the secondary will get TB's HP.Vengeful Spirit will Nether Swap to the primary target's location, the primary will move to the secondary, and the secondary will move to Venge.Winter Wyvern's Winter's Curse will work on both enemies and their allies will attack whichever hero is closest to them. However, if both Cursed targets are within the AoE of each other's Curse, neither of them will take any damage.Channeled spells like Bane's Fiend's Grip and Shadow Shaman's Shackles work as expected. You stay still, both enemies get affected.Only the primary hero gets targeted by Huskar's Life Break, Juggernaut's Omnislash, Morph's Morph, Phantom Assassin's Phantom Strike, Rubick's Spell Steal, Spirit Breaker's Charge, Tusk's Snowball and Walrus Punch, and Windranger's Focus Fire.Only the secondary hero gets targeted by Spirit Breaker's Nether Strike.The succ spells (Lion's Mana Drain, Pugna's Life Drain, Death Prophet's Spirit Siphon, Razor's Static Link) will work on both targets simultaneously.Talents which multiply how many times a spell projectile gets cast work as expected and double.",
      "Axe's Culling Blade will only give your cooldown back if the primary target is successfully Culled.",
      "Chaos Knight's Reality Rift will suck both targets in towards you.",
      "Kunkka's X will connect on both heroes, but casting the Return will only bring back the primary target.",
      "Legion Commander will quite literally 2v1 in a Duel. You'll get Duel damage for each target that dies. If you die, they'll both get damage. If the primary target dies, you'll move on to the secondary target for however much time is left. I have absolutely no clue how the primary target is chosen, I can't find any logic to it.",
      "Nature's Prophet's Wrath of Nature will only double up if you directly cast it on one of the targets, not if you ground target it.",
      "Oracle will start channeling another Fortune's End after the first one connects, but you won't see the channel bar on your HUD and you need to be standing still before the second channel starts.",
      "Primal Beast's Pulverize will fully stun both targets, but only the primary target will generate AoE smashing stuns. The secondary target will get teleported in front of Primal when Pulverize ends.",
      "Riki's Blink Strike will damage both heroes, but he'll end up on the primary target.",
      "Sniper will target the primary hero with Assassinate and then immediately shoot another projectile at the secondary target once the first connects.",
      "Tiny will attempt to Toss two units simultaneously at both targets.",
      "Terrorblade will Sunder the primary target's HP, the primary gets the secondary's HP, and the secondary will get TB's HP.",
      "Vengeful Spirit will Nether Swap to the primary target's location, the primary will move to the secondary, and the secondary will move to Venge.",
      "Winter Wyvern's Winter's Curse will work on both enemies and their allies will attack whichever hero is closest to them. However, if both Cursed targets are within the AoE of each other's Curse, neither of them will take any damage.",
      "Channeled spells like Bane's Fiend's Grip and Shadow Shaman's Shackles work as expected. You stay still, both enemies get affected.",
      "Only the primary hero gets targeted by Huskar's Life Break, Juggernaut's Omnislash, Morph's Morph, Phantom Assassin's Phantom Strike, Rubick's Spell Steal, Spirit Breaker's Charge, Tusk's Snowball and Walrus Punch, and Windranger's Focus Fire.",
      "Only the secondary hero gets targeted by Spirit Breaker's Nether Strike.",
      "The succ spells (Lion's Mana Drain, Pugna's Life Drain, Death Prophet's Spirit Siphon, Razor's Static Link) will work on both targets simultaneously.",
      "Talents which multiply how many times a spell projectile gets cast work as expected and double.",
      "The \"Soulbind Spell Damage\" talent amps damage fromallspells that the target(s) get hit by. They can be ground targeted, unit targeted, on a single Bound unit, doesn't matter.",
      "Agh's Scepter Dark Portrait illusions are debuff immune.Debuff immunity prevents Tormentor damage from reflecting on the target. You can potentially use your debuff immune Dark Portrait to solo a Tormentor.",
      "Debuff immunity prevents Tormentor damage from reflecting on the target. You can potentially use your debuff immune Dark Portrait to solo a Tormentor."
    ],
    "counter_tips": [
      "You can kill the Phantom's Embrace projectile while it's flying towards its target.",
      "The Phantom can't be dispelled, but will instantly die if you become invulnerable (like from a banish, Eul's cyclone, Manta Style activation, or Bane Nightmare).The Phantom will also instantly die if you turn invisible.",
      "The Phantom will also instantly die if you turn invisible.",
      "Remember that Grimstroke's Phantom's Embrace cooldown will be refreshed if you don't kill the ghost.",
      "Phantom's Embrace always has the highest priority for auto-attacking. Just attack+move to get it off if it's too hard to right click its hitbox.",
      "The Ink Swell buff can be dispelled off enemies, but it'll still stun and damage the area once dispelled.However, killing the Ink Swelled target will prevent the stun and damage from going off.",
      "However, killing the Ink Swelled target will prevent the stun and damage from going off.",
      "The Ink Trail debuff from Grimstroke's innate can be dispelled.",
      "You only count as leashed if Soulbind is actually binding you to someone else. If not, you can use movement spells and TPs freely.",
      "There are no reliable ways of breaking the Soulbind leash, so please cooperate with your chained ally to move around instead of comically stretching the bind in opposite directions. Think of it like one of those races where both of you have one leg tied together, except your teammate is actually a cat who's freaking out and wants nothing to do with this.Okay, I lied. There are afewreliable ways of breaking Soulbind. Earth Spirit can Boulder Smash people out, Huskar can just Life Break out of it, and Tiny can just Toss homies out of the break range.You can also use the movement during a self-cast Wind Waker to break out of the leash.",
      "Okay, I lied. There are afewreliable ways of breaking Soulbind. Earth Spirit can Boulder Smash people out, Huskar can just Life Break out of it, and Tiny can just Toss homies out of the break range.",
      "You can also use the movement during a self-cast Wind Waker to break out of the leash.",
      "If you're a carry and Grimstroke has made a Agh's Scepter Dark Portrait of you, focus it. It deals more damage than you, but it also dies very quickly. Don't get lazy, kill it immediately."
    ]
  }
}