{
  "name": "Hoodwink",
  "safe_name": "hoodwink",
  "strategies": {
    "general_tips": [
      "Pay attention to your buffs and try to keep your Mistwoods Wayfarer innate enabled whenever possible. You'll have significantly more survivability if you're hugging trees.",
      "Your Acorn Shot tree can enable Mistwoods Wayfarer innate evasion.",
      "If you have Acorn Shot on alt-cast (which can be toggled by right clicking the spell icon, or pressing alt+hotkey, or by holding ctrl+hotkey), it will always use ground targeting instead of unit targeting. Useful if you're trying to plant a tree with Acorn Shot in the middle of a bunch of units.",
      "You can bypass an enemy Linken's Sphere or Lotus Orb by having an Acorn bounce into them (either from your tree or from another target).",
      "Acorn Shot trees give 200 ground vision.",
      "Acorn Shot can bounce to units in fog and the acorn projectile provides a small radius of vision as it flies.",
      "Since Acorn Shot behaves as a right click, it'll break your Smoke if you directly target a unit.However, an attack from an alt-cast tree Acorn Shot willnotbreak your Smoke, even if it hits a unit.",
      "However, an attack from an alt-cast tree Acorn Shot willnotbreak your Smoke, even if it hits a unit.",
      "Since Acorn Shot behaves as a right click, it'll reveal you in fog to enemies if an Acorn hits any enemy unit.",
      "Acorn Shot bounces can proc any attack modifiers your hero has. They also ignores disarms. However, the shots can high ground miss if you're on a lower terrain than your targets.",
      "Acorn Shot attacks can be affected by miss chance, but not disarms. The attacks will still land if you're disarmed.",
      "Even if Acorn Shot attacks miss, the slow still lands.",
      "Acorn Shot's initial cast range can be increased by attack range bonusesandcast range bonuses.This means the extra range granted by Scurry's active with the \"Go Nuts\" facet also increases Acorn Shot range.",
      "This means the extra range granted by Scurry's active with the \"Go Nuts\" facet also increases Acorn Shot range.",
      "Since the tree from Acorn Shot provides collision, you can use it to push yourself out of Disruptor's Kinetic Field or Slark's Pounce leash.Just cast the Acorn Shot behind your hero, but inside the selection circle.You can also use this to break allies out of those spells. The tree collision could even theoretically push someone out who walked into the very edge of a Faceless Void's Chronosphere.",
      "If you target Bushwhack at a distance greater than ~400 range away and cancel the cast backswing, you can shoot an Acorn Shot tree into thevery edgeof the Bushwhack AoE and beat the net projectile before it lands. The margin is extremely tight, however.The easiest way to reliably pull this off is to observe the Bushwhack AoE as you're casting it and target the Acorn Shot right at the very edge of that AoE closest to your hero.",
      "The easiest way to reliably pull this off is to observe the Bushwhack AoE as you're casting it and target the Acorn Shot right at the very edge of that AoE closest to your hero.",
      "An Acorn Shot tree will never time out if targets are currently Bushwhacked to it.",
      "Bushwhack gives flying vision around its landing location even if it doesn't latch anything.",
      "Bushwhack can connect on fogged enemies, but not invisible enemies.",
      "Be aware that if allies (or enemies) apply any sort of forced movement or knockback to a Bushwhacked target, they'll instantly be freed. So if Queen of Pain Sonic Waves a Bushwhacked Anti-Mage, she better be using it to get the kill.",
      "If any fears are applied to a Bushwhacked enemy, they'll just straight up start walking out of your tree stun.",
      "Be wary of chaining Bushwhack into disables that break trees like Mars's Spear or Rubick's Telekinesis.",
      "The bonus cast range on Scurry with the \"Go Nuts\" facet works when casting items too. So you can do things like place Observer Wards farther when Scurry is active.",
      "You can push yourself down cliffs by letting the active Scurry buff time out in an unpathable location inside trees.",
      "You can use the recoil from Sharpshooter to move up and down cliffs to escape. It works while rooted or leashed, allowing you to break out of things like Slark's Pounce or even Disruptor's Kinetic Field.",
      "Enemies can hear you winding Sharpshooter up even through fog.",
      "Sharpshooter gets fully charged even before the countdown hits zero. You can check by either paying attention to your buffs or listening for the 'notching' sound cue.",
      "Sharpshooter ignores illusions and passes straight through them.",
      "You arenotdisabled during the Sharpshooter windup. You can't move or attack, but you can cast all your spells and items.You are limited to targeting spells and items perfectly in the direction you're aiming Sharpshooter. If you target something outside of the angle allowed, nothing will happen until after Sharpshooter ends.",
      "You are limited to targeting spells and items perfectly in the direction you're aiming Sharpshooter. If you target something outside of the angle allowed, nothing will happen until after Sharpshooter ends.",
      "If you get silenced while you're in the Sharpshooter windup, you won't be able to cancel the cast early.However,starting a TP channel instantly cancels Sharpshooter. So if you need to end a Sharpshooter early while silenced, target a TP scroll in your Sharpshooter line-of-sight and you'll be able to cancel it.",
      "Nothingcan interrupt a Sharpshooter cast except hitting the subspell hotkey or dying. Stuns, silences, banishes, doesn't matter, this squirrel's gonna get her nut.",
      "Activating Agh's Scepter Decoy isnotperfectly seamless. Enemies will briefly see you disappear before the Decoy illusion takes your place.",
      "Agh's Shard Hunter's Boomerang provides a small radius of vision around the projectile as it flies.",
      "Agh's Shard Hunter's Boomerang is blocked by Linken's Sphere if it's unit targeted, but not if it's ground targeted."
    ],
    "counter_tips": [
      "Destroying the tree that heroes are Bushwhacked to will immediately cancel the stun.",
      "If you see a Hoodwink running up to you and there are no trees around, just start spamming your Quelling Blade (if you have one) on the ground near you. If you're fast, you'll likely instantly cut the Acorn Shot tree she makes before you get Bushwhacked to it.",
      "In lane, just mash your Quelling Blade off cooldown to constantly cut trees. Hoodwink is much less intimidating if she has nothing to Bushwhack you to or hide in with Scurry.",
      "Applying any type of forced movement or knockback to a Bushwhacked hero will also free them. Like from a Force Staff or Snapfire's Firesnap Cookie.",
      "If a melee hero Lotus Orb reflects Acorn Shot, the reflected shots will only deal damage if the hero is within 350 + melee hero attack range (default 150) of the bounce targets. This is because Acorn Shot considers your hero as launching the bounce attack from their current location and melee heroes aren't allowed to hit targets more than 350 range away.",
      "Nothing can stop Sharpshooter from going off so don't bother wasting spells trying to cancel it. Just try to juke the projectile.",
      "If you silence a Hoodwink while she's charging Sharpshooter, she'll be locked in (unless she starts channeling a TP).",
      "The Sharpshooter debuff (the slow and the break) can be removed with basic dispels.",
      "Timbersaw's tendency to destroy all things trees makes it very difficult for Hoodwink to get Bushwhack stuns."
    ]
  }
}