{
  "name": "Leshrac",
  "safe_name": "leshrac",
  "strategies": {
    "general_tips": [
      "Split Earth destroys trees.",
      "The outrageously long cast animation on Split Earth is both a blessing and a curse. It's mainly a curse, but you can use it to your advantage. In lane, there are few things more irritating than seeing a Leshrac go allNapoleon Crossing the Alps,moving so you don't get stunned, and then him canceling the animation. You can also use the cast animation to stun people chasing you without having to turn around by casting it directly in front of your feet.",
      "When munching on a tower with Diabolic Edict (if you didn't take the Misanthropy facet), become a zen master of positioning. Just stand in the corner of the AoE so that you're only seeing explosions underneath the tower and give her the Edict. If you don't right click, you won't draw any aggro and the tower will continue attacking whichever unit is closest, which will still be the creeps.Certain towers have treelines next to them that you can hide in. Cast Edict while standing in fog and enemies won't even see you show up on their map while you destroy their tower.Here's a cute trick: Plant an Iron Branch tree in front of a tower and stand behind it while Edict is active. Assuming there's no enemy creeps, wards, or heroes to give vision of you, the enemy tower won't attack you because it can't see you unless you right click it.Try to bait out a Glyph when you walk up to a tower before using Edict. Edict has a cast time, so try to cancel it during your T-pose. Most of the time people will just Glyph the second they see Leshrac smugly standing alone by their tower, but it's still worth a shot.",
      "Certain towers have treelines next to them that you can hide in. Cast Edict while standing in fog and enemies won't even see you show up on their map while you destroy their tower.",
      "Here's a cute trick: Plant an Iron Branch tree in front of a tower and stand behind it while Edict is active. Assuming there's no enemy creeps, wards, or heroes to give vision of you, the enemy tower won't attack you because it can't see you unless you right click it.",
      "Try to bait out a Glyph when you walk up to a tower before using Edict. Edict has a cast time, so try to cancel it during your T-pose. Most of the time people will just Glyph the second they see Leshrac smugly standing alone by their tower, but it's still worth a shot.",
      "Diabolic Edict with the \"Misanthropy\" facet won't eventargettowers. This facet makes tower dives a little more viable.",
      "Diabolic Edict damage fully pierces debuff immunity/BKB.",
      "Edict will continue damaging the AoE around your corpse even after you die.",
      "Edict and Pulse Nova can hit invisible and fogged units. Try chasing down invis enemies if you think they'll be traveling a predictable path. Edict will even show you where the invisible unit is if you pay attention to the explosion particles on the ground.",
      "Lightning Storm won't bounce to any targets in fog.",
      "Use the slow on Lightning Storm to make it easier to land Split Earth.",
      "You can toggle Pulse Nova while channeling, like during a TP.",
      "Eul's Scepter is a great item on Leshrac. Aside from the fact that he loves all the stats, cyclone makes landing Split Earth on solo targets far easier."
    ],
    "counter_tips": [
      "Split Earth is one of the easiest stuns in the game to juke. It has an incredibly obvious and lengthy cast animation. It's usually worth running sideways or backwards a small distance just to dodge it.",
      "Avoid activating Glyph until you see Leshrac giving your towers the Edict (if he didn't take the Misanthropy facet). If you Glyph too early, Leshrac may just wait until your Glyph times out and then cast Edict.",
      "Clockwerk makes life difficult for Leshrac since Battery Assault cancels most of his cast animations.",
      "Blade Mail can discourage Leshrac from soloing you.",
      "Mage Slayer significantly reduces Leshrac's damage output.",
      "If you dispel Leshrac during Agh's Scepter Nihilism, the whole aura is canceled and removed."
    ]
  }
}