{
  "name": "Lone Druid",
  "safe_name": "lone_druid",
  "strategies": {
    "general_tips": [
      "Don't be afraid of letting your Spirit Bear wander away from you. Use it to draw aggro from an incoming creep wave, stack jungle camps, go shopping for you, go back to the fountain to heal, play checkers with Death Prophet, or just scout for you.",
      "If your Spirit Bear just died and you're on the losing end of a team fight, don't just cast it again in the hopes that you can turn the fight around. Save it for when you respawn.",
      "You and your team can deny the Spirit Bear to avoid giving its bounty to the enemy. You won't take any Backlash damage if you do.",
      "When you level up the Spirit Bear, it basically creates a fresh Bear unit on the spot. You can strategically time when you level up the Bear to take advantage of this.All the Bear's cooldowns are refreshed when it's leveled up. This can allow you to potentially double Entangle a target. Get a root with the Bear, the root is now on cooldown, level up the Bear, no more cooldown on root.Leveling up the Bear also resets Savage Roar's cooldown on the Bear. You can use this to double Roar enemies or you can cast Roar for free from the Bear because the Bear also gets full mana when leveled up.Leveling up the Bear also resets its resummon damage cooldown timer, allowing you to immediately resummon it when you level it up.Amusingly, resummoning the Bear doesnotreset cooldowns. Only HP and mana are reset on a resummoned Bear, but a leveled Bear gets fresh cooldowns and mana but not HP.Leveling up the Bear effectively 'kills' the old Bear and replaces it with a brand new unit. This means any buffs/debuffs that were on the old Bear will be gone and any projectiles traveling to the old Bear will be disjointed. So if your Bear gets stunned or Razor Static Linked, you can level it up to instantly remove those debuffs. Be aware that buffs, like from runes, willalsobe removed when the Bear is leveled up.Bizarrely, resummoning the Spirit Bear doesnotcount as a 'death' dispel. Buffs/debuffs will remain as if it was the same old Bear.",
      "All the Bear's cooldowns are refreshed when it's leveled up. This can allow you to potentially double Entangle a target. Get a root with the Bear, the root is now on cooldown, level up the Bear, no more cooldown on root.",
      "Leveling up the Bear also resets Savage Roar's cooldown on the Bear. You can use this to double Roar enemies or you can cast Roar for free from the Bear because the Bear also gets full mana when leveled up.",
      "Leveling up the Bear also resets its resummon damage cooldown timer, allowing you to immediately resummon it when you level it up.",
      "Amusingly, resummoning the Bear doesnotreset cooldowns. Only HP and mana are reset on a resummoned Bear, but a leveled Bear gets fresh cooldowns and mana but not HP.",
      "Leveling up the Bear effectively 'kills' the old Bear and replaces it with a brand new unit. This means any buffs/debuffs that were on the old Bear will be gone and any projectiles traveling to the old Bear will be disjointed. So if your Bear gets stunned or Razor Static Linked, you can level it up to instantly remove those debuffs. Be aware that buffs, like from runes, willalsobe removed when the Bear is leveled up.",
      "Bizarrely, resummoning the Spirit Bear doesnotcount as a 'death' dispel. Buffs/debuffs will remain as if it was the same old Bear.",
      "Whenever you Return the Bear, it always appears on the top-right of your hero, regardless of what direction you're facing.",
      "If you die and the Spirit Bear has Agh's Scepter, Returning the Bear will bring it to your dead body's location.",
      "Agh's Scepter Spirit Link on your hero can be cast on creep-heroes like Warlock's Golem or Visage's Familiars.",
      "Mechanically, think of the Spirit Bear like a 6th hero on your team. Any buffs/debuffs that would last differently on creeps versus heroes last the hero duration on the Spirit Bear. For the most part, interactions will behave similarly to clones like Arc Warden's Tempest Double or Meepos.Spells that create illusions will fully work on the Bear.Ward units that require a certain number 'hero attacks' to kill willnottreat the Bear like a hero, but instead a creep. Like Phoenix's Supernova or Pugna's Nether Ward.Global team spells like Chen's Hand of God, Centaur Warrunner's Stampede, or Mirana's Moonlight Shadow will work on the Bear. Spells like an enemy Zeus's Thundergod's Wrath will also hit the Bear.Some examples of spells thatcan'ttarget the Spirit Bear: Legion Commander's Duel, Bounty Hunter's Track, Rubick's Spell Steal, Morphling's Morph, Terrorblade's Sunder, Weaver's Agh's Scepter Time Lapse.Spells that grant enemies temporary buffs usually work on the Bear. Like Monkey King's Jingu Mastery stacks, Outworld Destroyer's Astral Imprisonment mana steal, Slark's Essence Shift temporary stat steal, and Silencer's Glaive temporary INT steal.Mars's Spear and Slark's Pounce treat the Spirit Bear like a creep, not a hero.Most spells that grant enemies permanent buffs on kills willnot procon the Bear. Like Axe's Culling Blade, Lion's Finger of Death, and Necrophos's Reaper's Scythe.",
      "Spells that create illusions will fully work on the Bear.",
      "Ward units that require a certain number 'hero attacks' to kill willnottreat the Bear like a hero, but instead a creep. Like Phoenix's Supernova or Pugna's Nether Ward.",
      "Global team spells like Chen's Hand of God, Centaur Warrunner's Stampede, or Mirana's Moonlight Shadow will work on the Bear. Spells like an enemy Zeus's Thundergod's Wrath will also hit the Bear.",
      "Some examples of spells thatcan'ttarget the Spirit Bear: Legion Commander's Duel, Bounty Hunter's Track, Rubick's Spell Steal, Morphling's Morph, Terrorblade's Sunder, Weaver's Agh's Scepter Time Lapse.",
      "Spells that grant enemies temporary buffs usually work on the Bear. Like Monkey King's Jingu Mastery stacks, Outworld Destroyer's Astral Imprisonment mana steal, Slark's Essence Shift temporary stat steal, and Silencer's Glaive temporary INT steal.",
      "Mars's Spear and Slark's Pounce treat the Spirit Bear like a creep, not a hero.",
      "Most spells that grant enemies permanent buffs on kills willnot procon the Bear. Like Axe's Culling Blade, Lion's Finger of Death, and Necrophos's Reaper's Scythe.",
      "Rules on what the Spirit Bear can interact with on the map:The Spirit Bear can activate and use every type of rune, Twin Gates, and Lotus Pools.The Spirit Bearcannotactivate Outposts or Watchers.The Spirit Bear can activate Shrines of Wisdom. However, the primary experience won't go to Lone Druid. Only the secondary experience will be granted to your team.",
      "The Spirit Bear can activate and use every type of rune, Twin Gates, and Lotus Pools.",
      "The Spirit Bearcannotactivate Outposts or Watchers.",
      "The Spirit Bear can activate Shrines of Wisdom. However, the primary experience won't go to Lone Druid. Only the secondary experience will be granted to your team.",
      "An enemy's Smoke of Deceit will not break if they get close to the Spirit Bear. However, a Smoked Bear behaves the same as a hero when approaching enemies. Mmmmm, Smoked Bear.",
      "Savage Roar gives you a guaranteed channel breaker. If someone's TPing in front of you, don't pray for an Entangle, just cast Savage Roar to cancel it.",
      "Savage Roar prevents the enemy from doinganythingduring its duration because fears are effectively a silence and a mute combined. This includes stopping enemies from activating BKB, Abaddon casting Borrowed Time, or Ursa casting Agh's Scepter Enrage.",
      "Savage Roar won't move heroes who are Entangled.",
      "Entangling Claws's proc chance utilizespseudo-random distribution (PRD).Statistically, about one in every five right clicks should be a root with 20%, but PRD encourages a lower likelihood of 'streaks.' If your Bear goes five attacks with no root, chances are now much higher that the Bear's next attackwillroot thanks to PRD. Try to exploit this by priming right clicks on jungle or lane creeps before going for a kill attempt.",
      "At max level, Savage Roar's fear should buy you enough time to complete a TP to escape from a gank.",
      "Agh's Shard Savage Roar can dispel a Eul's Cyclone. Just cast it from whichever unit isn't cycloned, either you or the Bear, and the other one will be freed.",
      "The Spirit Bear can use TP scrolls/Boots of Travel. It's always worth keeping a scroll on your Bear. In lane, let the Bear go back to base to heal, then use it as a courier and Return it back. In the mid/late game, it's another way to get it to escape if the Return channel gets canceled.Keeping a TP scroll on the Bear also allows it to travel to other lanes easily. Teammate getting ganked under the tower but you're busy farming? Let the Bear teleport over, Savage Roar the enemies away, then Return back to you.",
      "Keeping a TP scroll on the Bear also allows it to travel to other lanes easily. Teammate getting ganked under the tower but you're busy farming? Let the Bear teleport over, Savage Roar the enemies away, then Return back to you.",
      "The Spirit Bear can consume Moon Shard.",
      "Agh's Shard Spirit Bear Fetch roots targeted heroes, but doesn't disarm them. Enemies and allies can both still attack while being Fetched.",
      "Agh's Shard Spirit Bear Fetch shares priority with Batrider's Lasso. Whichever spell comes after will override the previous one.There are some other mechanic similarities between Fetch and Lasso. If you apply a fear (like Savage Roar) to a target that's getting Agh's Shard Fetched, it'll end the Fetch (same as Lasso).",
      "There are some other mechanic similarities between Fetch and Lasso. If you apply a fear (like Savage Roar) to a target that's getting Agh's Shard Fetched, it'll end the Fetch (same as Lasso)."
    ],
    "counter_tips": [
      "Most spells treat the Spirit Bear like a hero/clone as opposed to a creep. Read the tips above for a more detailed list on how certain spells interact with the Bear.",
      "Bully the Bear in the first few minutes of the laning phase. The Spirit Bear gets tankier as it levels up. Don't worry about harassing the hero, just try to whittle down the Bear.",
      "If you see that the Spirit Bear suddenly has full HP in lane, it's a great time to kill Lone Druid since he probably just spawned a fresh one. If you manage to get him Bearless in lane, you just murdered his early game.",
      "Killing the Spirit Bear will net you a pretty hefty gold and experience bounty. If you know the Druid is definitely going to die, try killing the Bear first before finishing off the hero.",
      "The easiest way to kill the Spirit Bear in the mid/late game is with minus armor. Desolator and Assault Cuirass are worthwhile items to consider against Lone Druid.",
      "Applying Break on the Spirit Bear disables the Demolish passive that gives the Bear increased magic resistance and bonus tower damage.",
      "The Spirit Bear does not count as a hero unit to dispel Smoke of Deceit.Phantom Assassin's Blur doesn't dispel on the Bear either. She can even attack the Spirit Bear while Blurred.",
      "Phantom Assassin's Blur doesn't dispel on the Bear either. She can even attack the Spirit Bear while Blurred.",
      "If Lone Druid is pushing your tower, try to save the Glyph for when he triggers True Form.",
      "Savage Roar and other fears can be dispelled off allies with basic dispels, like from Lotus Orb.",
      "If Disruptor Glimpses a freshly spawned or freshly leveled-up Spirit Bear, it'll immediately get sent to the very middle of the map (Dire's mid lane river high ground)."
    ]
  }
}