{
  "name": "Mars",
  "safe_name": "mars",
  "strategies": {
    "general_tips": [
      "Mars's Dauntless innate procs against enemies in fog. If you're farming by yourself, you could keep an eye on your buffs to see if enemies may be rotating to kill you.",
      "Items like Healing Salves or Tangoes benefit from Dauntless's innate regen amp. Burst heals, like from Magic Stick/Wand or Healing Lotuses, donotbenefit.",
      "Spear of Mars provides flying vision as it travels and the vision lingers around an impaled enemy.",
      "Spear of Mars doesnotignore illusions, it'll skewer them just like a normal hero.",
      "Spear of Mars turns enemies around to face you when they're impaled. This is mainly useful against Bristleback.",
      "Only the primary target of the Spear that is skewered gets stunned. The bump on other enemies in the path of the Spear does not count as a disable.",
      "What are valid Spear walls that you can pin people to?You can pin people to trees, buildings (like towers or barracks), Outposts, Twin Gates, and high ground cliffs.You can pin people to the center of Shrines of Wisdom whether they're active or not.You can pin people to Clockwerk's Power Cogs, Drow Ranger's Agh's Shard Glacier, Nature's Prophet's Sprout, Tusk's Ice Shards, and Underlord's Fiend's Gate.You can pin people to Iron Branch trees but the hitbox is tiny. You need to aim the Spear basically perfectly in the center of the tree.You can pin people to the Arena of Blood's walls (obviously).",
      "You can pin people to trees, buildings (like towers or barracks), Outposts, Twin Gates, and high ground cliffs.",
      "You can pin people to the center of Shrines of Wisdom whether they're active or not.",
      "You can pin people to Clockwerk's Power Cogs, Drow Ranger's Agh's Shard Glacier, Nature's Prophet's Sprout, Tusk's Ice Shards, and Underlord's Fiend's Gate.",
      "You can pin people to Iron Branch trees but the hitbox is tiny. You need to aim the Spear basically perfectly in the center of the tree.",
      "You can pin people to the Arena of Blood's walls (obviously).",
      "What are things that you'd think are valid Spear walls that actually aren't?Youcannotpin people to any of the bottom Rosh pit walls. There are some trees around the pit that count, but the walls themselves do not.Only theback wallof the top Rosh pit counts as a valid wall. The sides of the pit do not.The walls surrounding your base's high ground aren't really \"walls.\" They follow the same rules as other cliffs (you can only Spear targets from low ground -> high ground, not the other way around).Youcannotpin people to any part of a Lotus Pool.Youcannotpin people to Earthshaker's Fissureas of this patch.The random features on the map like crystals jutting out on Radiant are inconsistent. The ones that look like they are at the same elevation as your hero usually don't work. The ones that look sunken into the map usually do work.",
      "Youcannotpin people to any of the bottom Rosh pit walls. There are some trees around the pit that count, but the walls themselves do not.",
      "Only theback wallof the top Rosh pit counts as a valid wall. The sides of the pit do not.",
      "The walls surrounding your base's high ground aren't really \"walls.\" They follow the same rules as other cliffs (you can only Spear targets from low ground -> high ground, not the other way around).",
      "Youcannotpin people to any part of a Lotus Pool.",
      "Youcannotpin people to Earthshaker's Fissureas of this patch.",
      "The random features on the map like crystals jutting out on Radiant are inconsistent. The ones that look like they are at the same elevation as your hero usually don't work. The ones that look sunken into the map usually do work.",
      "Forced movement or knockbacks can shift enemies around after they get skewered, but as long as the Spear still connects to a wall/tree, the enemy will still get stunned wherever they are. God's Rebuke counts as a knockback, so if you're quick,you can Rebuke a target while they're flying back from your Spear to cancel the Spear movement.However, keep in mind that applying any forced movement or knockbacks during the Spear will also briefly remove the stun debuff from an enemy until the Spear hits a wall. So if you're against enemies with instant cast spells or items like BKB/Eul's, they will be able to activate the spell/item during the Rebuke bump.",
      "However, keep in mind that applying any forced movement or knockbacks during the Spear will also briefly remove the stun debuff from an enemy until the Spear hits a wall. So if you're against enemies with instant cast spells or items like BKB/Eul's, they will be able to activate the spell/item during the Rebuke bump.",
      "If your Spear is traveling through an enemy when they come out of a banish/hide, like someone being Eul's Cycloned, the Spear will stun them before they can cast anything. For example, Eul's a Puck and toss a Spear perfectly so they land on it when the Cyclone ends and they can't get Phase Shift off.You can't beat BKB with this, though. Debuff immunity always gets tick priority.",
      "You can't beat BKB with this, though. Debuff immunity always gets tick priority.",
      "Invisible units can get Speared, but you'll only get true sight on the target if they get impaled on something.",
      "The impact particle effect from God's Rebuke can indirectly show where an invisible unit is.",
      "God's Rebuke's can't bump enemies out of Disruptor's Kinetic Field, but Spear of Marswillyeet enemies out of the Field.",
      "The knockback on God's Rebuke does not count as a disable and will not cancel enemy channels.",
      "God's Rebuke performs a true strike instant attack on all targets in the AoE. This means each target has a chance to proc/apply attack modifiers, excluding cleave. Just keep in mind that most chance based procs from items have an internal cooldown and can't proc multiple targets simultaneously.",
      "God's Rebuke can kill enemy couriers.",
      "Since God's Rebuke includes a 'right click,' it'll break your Smoke if it damages a unit.",
      "Bulwark only reduces damage from attacks andinstant attacks, but not physical damage spells.",
      "When Bulwark is toggled on, any ranged attack projectile launched to a target in a cone behind Mars has a percentage chance to travel straight to Mars instead of their original intended targets. This also works against projectiles from Medusa's Split Shot or Gyrocopter's Flak Cannon.You can also redirect attacks with active Bulwark by standing within 100 units of the ally being targeted. The angle of the source attack does not matter if you're this close.Active Bulwark will redirect attacks from towers, including the multishots from Glyphed towers.Active Bulwark will redirect attacks from ward-type units, like Shadow Shaman's Serpent Wards or Witch Doctor's Death Ward.",
      "You can also redirect attacks with active Bulwark by standing within 100 units of the ally being targeted. The angle of the source attack does not matter if you're this close.",
      "Active Bulwark will redirect attacks from towers, including the multishots from Glyphed towers.",
      "Active Bulwark will redirect attacks from ward-type units, like Shadow Shaman's Serpent Wards or Witch Doctor's Death Ward.",
      "Active Bulwark gives Mars phased movement allowing him to pass through other units.",
      "You can toggle Bulwark while channeling a TP.",
      "When Bulwark is toggled on, you don't have to turn to cast items. This includes items targetable on enemies, like Eul's, Force Staff, Urn of Shadows, etc.Normally, casting a TP scroll will turn your hero to the direction of the structure you're traveling to. But since you don't have to turn to cast items when Bulwark is on, you can also avoid turning to your TP target. This can be useful if you're escaping and TP'ing to fountain. Face your attackers, toggle Bulwark on, then channel the TP to benefit from Bulwark's damage reduction while TP'ing in the opposite direction.Not having to turn for items can be especially useful if you have a Blink and are getting Eul's combo'd and you have a way to mitigate the landing damage of the cyclone (like Pipe). While you're cycloned, activate the Pipe, shift+queue Bulwark's active, then shift+queue your Blink Dagger and you should be able to instantly Blink out without having to turn.",
      "Normally, casting a TP scroll will turn your hero to the direction of the structure you're traveling to. But since you don't have to turn to cast items when Bulwark is on, you can also avoid turning to your TP target. This can be useful if you're escaping and TP'ing to fountain. Face your attackers, toggle Bulwark on, then channel the TP to benefit from Bulwark's damage reduction while TP'ing in the opposite direction.",
      "Not having to turn for items can be especially useful if you have a Blink and are getting Eul's combo'd and you have a way to mitigate the landing damage of the cyclone (like Pipe). While you're cycloned, activate the Pipe, shift+queue Bulwark's active, then shift+queue your Blink Dagger and you should be able to instantly Blink out without having to turn.",
      "Agh's Scepter Bulwark soldiers attack once per second. The one second interval is calculated only while Bulwark is toggled on. You can somewhat abuse this by toggling Bulwark on during the 'backswing' interval, then toggling off before the soldiers are about to attack. Then the next time you toggle them on, they'll attack immediately, and then reset again for another full second.",
      "Agh's Scepter Bulwark soldiers can proc any attack modifiers your hero has. They can also attack buildings.",
      "Agh's Scepter Bulwark soldiers will not attack if you are stunned or disarmed.",
      "Agh's Scepter Bulwark soldiers are actual units with actual vision. This means that if you can maneuver one of them into the Rosh pit or on a high ground, they can provide roughly 800 vision that your hero couldn't naturally see.",
      "If you're quick fingered, you cancast Arena while an enemy is flying from your Spear and pin them to the Arena wall as it forms.",
      "Arena of Blood blocks enemy attack projectiles from entering the ring. This includes attacks from towers or the fountain.",
      "With the \"Blood Sport\" facet, enemies outside the Arena can't see anything that's happening inside the Arena and vice versa for enemies who are stuck inside the Arena.Technically, vision isn'tblockedwithin the Arena. For enemies outside the Arena: They either need flying vision, a ward inside the Arena, or a source of vision two high ground elevations above the Arena to be able to see what's going on in the Arena.For enemies inside the Arena: They need flying vision to see what's going on outside. Wards will not provide any vision for people stuck inside the Arena.Spells that provide vision work as expected to give the caster vision inside or outside the Arena. This vision is shared with other teammates who share the same Arena state. For example: An enemy Clockwerkinsidethe Arena can shoot a Rocket Flare outside the Arena and all enemiesinside the Arenawill be able to see what that Flare sees. Conversely, an enemy Clockwerkoutsidethe Arena can shoot a Rocket Flare inside the Arena and all enemiesoutside the Arenawill be able to see what that Flare sees.Regardless of your hero's Arena state, you will always share vision with what any units/summons under your control can see, including your courier.If anyone inside the Arena is debuff immune/BKB'd, then everyone on their team can see what they see. Debuff immunity outside the Arena will not allow you to see inside, but you can walk inside to show your team what's going on.Invulnerability, such as from an active Eul's cyclone, or a banish, like Puck's Phase Shift, will also allow a teammate within the Arena to briefly share their vision with the team.",
      "Technically, vision isn'tblockedwithin the Arena. For enemies outside the Arena: They either need flying vision, a ward inside the Arena, or a source of vision two high ground elevations above the Arena to be able to see what's going on in the Arena.",
      "For enemies inside the Arena: They need flying vision to see what's going on outside. Wards will not provide any vision for people stuck inside the Arena.",
      "Spells that provide vision work as expected to give the caster vision inside or outside the Arena. This vision is shared with other teammates who share the same Arena state. For example: An enemy Clockwerkinsidethe Arena can shoot a Rocket Flare outside the Arena and all enemiesinside the Arenawill be able to see what that Flare sees. Conversely, an enemy Clockwerkoutsidethe Arena can shoot a Rocket Flare inside the Arena and all enemiesoutside the Arenawill be able to see what that Flare sees.",
      "Regardless of your hero's Arena state, you will always share vision with what any units/summons under your control can see, including your courier.",
      "If anyone inside the Arena is debuff immune/BKB'd, then everyone on their team can see what they see. Debuff immunity outside the Arena will not allow you to see inside, but you can walk inside to show your team what's going on.",
      "Invulnerability, such as from an active Eul's cyclone, or a banish, like Puck's Phase Shift, will also allow a teammate within the Arena to briefly share their vision with the team.",
      "With the \"Blood Sport\" facet, you could hypothetically place an Arena around a tower and siege it without the enemy team being able to see anyone on your team hitting it. This is because the tower won't be able to share its vision to the enemy team.",
      "If a debuff immune ranged enemy is about to kill you during the Arena, weave in and out of the Arena walls. The enemy hero may be able to pass through the walls, but their attack projectiles still get blocked.",
      "Roshan can't pass through the Arena walls and will get stuck on the edge.",
      "Here are the rules of engagement when dealing with the Arena of Blood:Enemies can freely blink in or out of the Arena. You should initiate against Blink Dagger carriers by hitting them with God's Rebuke first to break their Dagger so they can't just Blink out of your Arena.Enemies with movement spells that provide invulnerability during travel (like Earth Spirit's Rolling Boulder, Faceless Void's Time Walk, Morphling's Waveform, Storm Spirit's Ball Lightning, Wind Waker's active cyclone) can freely pass through the Arena walls.Debuff immunity/BKB allows enemies to pass freely through the Arena walls.Spells that provide flying movement, unobstructed movement, or otherwise modify a hero's z-axis donotallow passage out of the Arena walls.Heroes can utilize forced movement or knockback spells to shove targetsintoyour Arena, like with Earth Spirit's Boulder Smash or Keeper of the Light's Blinding Light, but they can't use those spells to take peopleout ofthe Arena.Enemy Clockwerk can Hookshot, Dawnbreaker can Celestial Hammer, and Marci can Reboundintothe Arena, but not out. They'll get canceled by the wall soldier before they reach their target.Force Staff cannot push enemies in or out of the Arena.Pudge can Meat Hook enemy heroes in or out of the Arena. When Hooking them out, they'll still bump into the Arena wall, but Meat Hookalwaysbrings targets to the Hook location once it ends.The Arena wall soldiers will attack invisible units regardless of detection.The wall soldier knockback is non-disabling, so God's Rebuking a TP'ing enemy into the wall won't cancel their channel.",
      "Enemies can freely blink in or out of the Arena. You should initiate against Blink Dagger carriers by hitting them with God's Rebuke first to break their Dagger so they can't just Blink out of your Arena.",
      "Enemies with movement spells that provide invulnerability during travel (like Earth Spirit's Rolling Boulder, Faceless Void's Time Walk, Morphling's Waveform, Storm Spirit's Ball Lightning, Wind Waker's active cyclone) can freely pass through the Arena walls.",
      "Debuff immunity/BKB allows enemies to pass freely through the Arena walls.",
      "Spells that provide flying movement, unobstructed movement, or otherwise modify a hero's z-axis donotallow passage out of the Arena walls.",
      "Heroes can utilize forced movement or knockback spells to shove targetsintoyour Arena, like with Earth Spirit's Boulder Smash or Keeper of the Light's Blinding Light, but they can't use those spells to take peopleout ofthe Arena.",
      "Enemy Clockwerk can Hookshot, Dawnbreaker can Celestial Hammer, and Marci can Reboundintothe Arena, but not out. They'll get canceled by the wall soldier before they reach their target.",
      "Force Staff cannot push enemies in or out of the Arena.",
      "Pudge can Meat Hook enemy heroes in or out of the Arena. When Hooking them out, they'll still bump into the Arena wall, but Meat Hookalwaysbrings targets to the Hook location once it ends.",
      "The Arena wall soldiers will attack invisible units regardless of detection.",
      "The wall soldier knockback is non-disabling, so God's Rebuking a TP'ing enemy into the wall won't cancel their channel."
    ],
    "counter_tips": [
      "I advise scrolling up and reading through the Arena rules to figure out what does and doesn't work to get out of it. Quick reference is blinks (Phantom Assassin's Phantom Strike, Riki's Blink Strike, actual Blinks), invulnerable movement spells (Faceless Void's Time Walk, Morphling's Waveform, Storm Spirit's Ball Lightning), and debuff immunity (Juggernaut's Blade Fury, Lifestealer's Rage, Omniknight's Repel, building BKB) allows you to pass through the Arena.",
      "Bulwark can be disabled with Breaks.",
      "Heroes dealing high magic damage are invaluable since Bulwark only reduces right clicks.",
      "Spells can travel through the Arena of Blood, but ranged right click projectiles will be blocked by the wall.",
      "If you have a Quelling Blade/Battle Fury or Tango, you can try to go for big plays by lining yourself up with a tree for him to Spear you against and then destroying the tree before the Spear connects.",
      "After Spear is used, Mars has no way to cancel TPs. Neither God's Rebuke nor Arena soldiers cancel channels."
    ]
  }
}