{
  "name": "Mirana",
  "safe_name": "mirana",
  "strategies": {
    "general_tips": [
      "Be extra aware of Lotus Pool spawns because your Selemene's Faithful innate provides bonus regen on Lotuses for your whole team.",
      "The second Starstorm hit will land on the closest target to your hero when the spell was cast.",
      "Primary Starstorms can't hit units in fog, but the secondary hit searches through fog. If someone's at critical HP and juking in trees, you can safely cast the Starstorm blindly and let the second Starstorm hit get the kill.",
      "The idea behind landing consistent Arrows is trying to throw them in a way that gives you a large window to hit a target and a small window for them to notice the Arrow. If you're tossing out Arrows that are 90 degrees opposite your target, you're giving yourself a very small frame for the Arrow to hit. It can be smart to sacrifice some time of the target running to give yourself a more forgiving/parallel angle.The more realistic idea behind landing consistent Arrows is pairing it with other stuns or disables.",
      "The more realistic idea behind landing consistent Arrows is pairing it with other stuns or disables.",
      "During downtime, you can quickly one-shot a big creep in the jungle with a Sacred Arrow for some easy experience and gold. The biggest creeps usually chill in the back of creep camps, so learn how to position yourself accordingly. Just be sure to finish off the rest of the camp so it'll respawn... Unless you're sniping enemy jungle camps, I guess.Sacred Arrow can also one-shot siege creeps.",
      "Sacred Arrow can also one-shot siege creeps.",
      "Sacred Arrow kills creeps through the Glyph or Roshan's Banner invulnerability.",
      "Sacred Arrow provides flying vision as it travels and lingers for a few seconds wherever it ends.",
      "You don't need to hit Sacred Arrow from maximum cast range to get the full stun/damage. It reaches max power at half its full travel distance.",
      "You can begin the Sacred Arrow cast animation mid-Leap. This helps in giving an enemy less time to react to you winding up the Arrow.This even works when throwing Arrows backwards when escaping. The best way to do a butt Arrow is to cast Leap and then immediately target Sacred Arrow in front of your Leaping hero, but behind the Leap's finishing point. If done correctly, Mirana will toss the Arrow backwards with a very short animation. You'll just need to practice to make sure you're targeting the right angles.",
      "This even works when throwing Arrows backwards when escaping. The best way to do a butt Arrow is to cast Leap and then immediately target Sacred Arrow in front of your Leaping hero, but behind the Leap's finishing point. If done correctly, Mirana will toss the Arrow backwards with a very short animation. You'll just need to practice to make sure you're targeting the right angles.",
      "When escaping, ideally save Leap charges to travel across cliffs or treelines rather than panicking and immediately blowing charges where the enemy can easily follow you.",
      "Pay attention to the map to see if you can use Moonlight Shadow to help out teammates.Also, pay attention to the map to make sure none of your teammates are in vision when using Moonlight Shadow to be sneaky. If enemies see the crescent moon buff show up over one of your allies for no reason, they'll probably start playing very safe.",
      "Also, pay attention to the map to make sure none of your teammates are in vision when using Moonlight Shadow to be sneaky. If enemies see the crescent moon buff show up over one of your allies for no reason, they'll probably start playing very safe.",
      "It's a common tactic to use Smoke of Deceit in combination with Moonlight Shadow. You can take advantage of Smoke's move speed bonus and use the invis fading away on Smoke to know when you're getting close to the enemy while maintaining invis under Moonlight.",
      "If you're Dusted while Moonlight Shadow invis, you can dispel the debuff (after you walk out of the AoE) with basic dispels, like from Eul's Scepter, Guardian Greaves, Lotus Orb, or Manta Style."
    ],
    "counter_tips": [
      "It's highly important to contest Lotus Pools in lane when a Mirana is on the enemy team because of her Selemene's Faithful innate providing bonus regen.",
      "If there's a Mirana on the enemy team, treat her like a Pudge in the laning phase as far as movement and positioning is concerned. Hug creeps, don't stand still, and get mad at your teammates for being Arrow magnets.Sometimes youdowant to tank Arrows, though. If you feel pretty safe pushing a tower, stand near your siege creep to protect from instantly dying to Sacred Arrow.",
      "Sometimes youdowant to tank Arrows, though. If you feel pretty safe pushing a tower, stand near your siege creep to protect from instantly dying to Sacred Arrow.",
      "Moonlight Shadow lasts an eternity in Dota time. You really need a ton of sentry wards and Dust whenever you're pushing into a competent team that has a PotM.",
      "Mirana cannot Leap when rooted/leashed.",
      "Undying's Tombstone zombies can be annoying for Mirana to deal with since they tank Sacred Arrow."
    ]
  }
}