{
  "name": "Monkey King",
  "safe_name": "monkey_king",
  "strategies": {
    "general_tips": [
      "Boundless Strike's damage is applied as aninstant attack. This instant attack ignores disarms, has true strike, and applies attack modifiers (except cleave). If you have an attack modifier with a proc, it'll roll for a chance to proc on each target hit.Since Boundless Strike is an instant attack, it'll break your Smoke if it damages a unit.",
      "Since Boundless Strike is an instant attack, it'll break your Smoke if it damages a unit.",
      "If you Boundless Strike Mud Golems to death, the Shard Golems will also get hit by the Boundless Strike as they spawn. Small farming efficiency note.",
      "All on-hit effects can proc from Boundless Strike except for cleave. This includes adding or consuming Jingu Mastery stacks.",
      "No matter how many targets are hit in Boundless Strike, only one Jingu Mastery stack is consumed. If you're low on HP and have Jingu active, try saving Boundless to smack an entire creep wave and lifesteal off every target.",
      "You can't place Jingu stacks on illusions. An optimist sees this as a way to identify the real Phantom Lancer with a Boundless Strike, a pessimist would be angry they can't tap that unattended Terrorblade illusion for a free Jingu.",
      "If you save your first skill point in Tree Dance, you can skill it up and immediately cast it after taking damage since the damage cooldown is only in effectafterthe spell is learned.",
      "You're considered two 'levels' of high ground elevation up when perched during Tree Dance, but enemy units will have vision of you at their ground level whenever you're jumping from tree to tree.",
      "Ground targeted spells will affect you normally when you're on a tree and you can still detonate Techies Proximity Mines while jumping or sitting on a tree.",
      "Casting Boundless Strike or Mischief won't unperch you from a tree, but finishing a Wukong's Command cast will. You can use items, like TP, without getting unperched.",
      "The enemy will hear your Primal Spring channeling sound at wherever the landing is targeted.",
      "Don't attempt to Primal Spring through Disruptor's Kinetic Field or Mars's Arena. You'll get stuck on the edge and won't be able to act until their spell ends and your Spring finally finishes traveling.",
      "Here are a few Mischief interactions:When in Mischief, you won't appear on the enemy minimap at all. Handy for courier sniping or sneaking through warded areas.Enemy towers and creeps won't attack you when you're in Mischief.The first 0.1s of Mischief providesdamageimmunity from any source. It's not a disjoint and it's not a banish, but you can prevent taking damage from any incoming projectiles/attacks/damage over time ticks for that period.You can instantly drop aggro from creeps by going into Mischief.Right clicking heroes while in Mischief won't draw aggro from creeps, but creeps will aggro you as soon as you start your attack.Activating Mischief in most situations will turn you into a Courier, Iron Branch, Clarity, Salve, TP Scroll, Tango, or a banana.If you're standing next to a non-hero unit, like a lane/neutral creep or summoned unit (excluding creep-heroes), you'll turn into that unit.Other transformations are location dependent. Standing near a tree will make you a tree. Rosh pit will make you an Aegis, Cheese, Refresher Shard, or Roshan himself. Rune spot will make you a bounty or power rune depending on location.The enemy can't see the Jingu Mastery buff over your head when you're in Mischief, but debuffs (like Dust or Ursa's Fury Swipes) will still show above your disguise.",
      "When in Mischief, you won't appear on the enemy minimap at all. Handy for courier sniping or sneaking through warded areas.",
      "Enemy towers and creeps won't attack you when you're in Mischief.",
      "The first 0.1s of Mischief providesdamageimmunity from any source. It's not a disjoint and it's not a banish, but you can prevent taking damage from any incoming projectiles/attacks/damage over time ticks for that period.",
      "You can instantly drop aggro from creeps by going into Mischief.",
      "Right clicking heroes while in Mischief won't draw aggro from creeps, but creeps will aggro you as soon as you start your attack.",
      "Activating Mischief in most situations will turn you into a Courier, Iron Branch, Clarity, Salve, TP Scroll, Tango, or a banana.",
      "If you're standing next to a non-hero unit, like a lane/neutral creep or summoned unit (excluding creep-heroes), you'll turn into that unit.",
      "Other transformations are location dependent. Standing near a tree will make you a tree. Rosh pit will make you an Aegis, Cheese, Refresher Shard, or Roshan himself. Rune spot will make you a bounty or power rune depending on location.",
      "The enemy can't see the Jingu Mastery buff over your head when you're in Mischief, but debuffs (like Dust or Ursa's Fury Swipes) will still show above your disguise.",
      "Mechanically, Wukong's Command soldiers have your right click plus whatever items you have.",
      "Wukong's Command soldiers can't proc Basher/Abyssal or Echo Sabre, but they can proc every other on-hit item effect. They also individually carry whatever auras your hero has, including Radiance.Wukong soldiers do not copy your neutral item.",
      "Wukong soldiers do not copy your neutral item.",
      "Agh's Scepter soldiers won't attack buildings unless the real Monkey King is within 500 range of them.",
      "Agh's Scepter soldiers will disappear when you die, even if you have an Aegis."
    ],
    "counter_tips": [
      "Tree Dance follows a stricter set of Blink Dagger rules in terms of going on cooldown when damaged, so DoT spells or things like Urn help make Monkey King a little less slippery. It's stricter than Blink Dagger because even damage from lane/neutral creeps will put it on cooldown.",
      "Destroying the tree Monkey King is perched on will stun him for a hefty period of time. Not many heroes can easily take advantage of this, but: Beastmaster's Wild Axes, Windranger's Powershot, Storm Spirit's Ball Lightning, Phoenix's Icarus Dive and Supernova, Enigma's Midnight Pulse, Keeper of the Light's Agh's Scepter Will-O-Wisp, Mars's Arena of Blood, Underlord's Fiend's Gate, Timbersaw's everything, Earth Spirit's everything, or Batrider's Firefly are a few examples of spells that are either fast enough or large enough to catch a Tree Dancing Monkey King by surprise.",
      "Don't forget about the tree cutting capabilities of Quelling Blade or Battle Fury late game. Force Staff can also break trees.This is probably useless information, but Quelling Blade's active doesn't share a cooldown with Battle Fury allowing you to cutdouble the trees!The passive Quell bonus damage from both items also stack...",
      "This is probably useless information, but Quelling Blade's active doesn't share a cooldown with Battle Fury allowing you to cutdouble the trees!The passive Quell bonus damage from both items also stack...",
      "Roshan's Banner is a long range instant cast item that destroys trees in a fairly large AoE. In a late game situation, it could be worth sitting on the Banner in your inventory to stun a Tree Dancing Monkey King.",
      "You'll need vision of him to even know what tree he's on to begin with. Heroes with vision providing spells like Razor's Plasma Field, Disruptor's Thunder Strike, Puck's Illusory Orb, or Drow Ranger's Agh's Shard Glacier can be handy. Shiva's Guard's active also provides a lot of flying vision.",
      "Nature's Prophet's Agh's Shard Curse of the Oldgrowth can easily reveal a nearby Monkey King who's jumping around in trees.",
      "Monkey's Jingu Mastery damage+lifesteal buff can be removed with basic dispels. This makes heroes like Oracle with Fortune's End or Enchantress with Enchant useful in the laning phase or Shadow Demon with Demonic Purge useful in the late game.",
      "The audio cue from Primal Spring is played based on your camera placement. For example, if you hear the guzheng to your left, he targeted the Spring on the left side of whatever your camera's looking at.",
      "Wukong's Command soldiers' right clicks can be reduced by damage block from Vanguard or Crimson Guard.",
      "You can try shoving Monkey King out of his Wukong's Command circle to end the spell with a Force Staff if he's near the edge or use spells that Fear or spells that apply forced movement or knockback like Batrider's Flamebreak or Keeper of the Light's Blinding Light.",
      "Glyphing the creep wave can be an effective way to minimize the amount of lifesteal MK gets from a Boundless Strike if he has Jingu ready."
    ]
  }
}