{
  "name": "Necrophos",
  "safe_name": "necrophos",
  "strategies": {
    "general_tips": [
      "If you use the \"Profane Potency\" facet, I recommend going into your settings and enabling the Dota Labs \"Persistent Range Indicators\" feature. The AoE of your Death Pulse will constantly be changing, this allows you to dynamically keep track of the max distance.",
      "You get innate Sadist regen stacks off of any unit you kill including buildings, wards, and creep denies. The only exceptions are illusions or Arc Warden's Tempest Double.",
      "\"Nah they're dead, Death Pulse will get them.\" No. Death Pulse never gets them. Somehow enemies will inevitably heal just barely enough HP in time and you'll be left wondering, \"Wait, they didn't die?\" Always finish the kill either with Heartstopper Aura, Reaper's Scythe, or auto attacks.",
      "Death Pulse can hit invis and fogged units.",
      "Heartstopper Aura will deal damage to enemies in fog, but they won't see a Heartstopper debuff in their status bar if they don't have vision of you.You can't cheat this to see if enemies have vision of you or not, however. Your team will always see the Heartstopper debuff in an enemy's status bar regardless of if they have vision of you or not.",
      "You can't cheat this to see if enemies have vision of you or not, however. Your team will always see the Heartstopper debuff in an enemy's status bar regardless of if they have vision of you or not.",
      "Ghost Shroud boosts HP/mana regen given to you fromallsources, including teammates. Shroud yourself before a Keeper of the Light Chakra Magic or Omniknight Purification or Mekansm/Greaves or Arcane Boots.Also, Ghost Shroud yourself before using a Magic Wand or Healing Lotus for the regen amp.",
      "Also, Ghost Shroud yourself before using a Magic Wand or Healing Lotus for the regen amp.",
      "Ghost Shroud makes you immune to physical damage even from spells, such as Juggernaut's Omnislash or Bristleback's Quill Spray.",
      "You get permanent Reaper's Scythe stacks off Aegis kills or Wraith King Reincarnation kills.You can even get permanent Reaper's Scythe stacks by killing enemy illusions.",
      "You can even get permanent Reaper's Scythe stacks by killing enemy illusions.",
      "Agh's Shard Death Seeker can be a useful spell to break Linken's Sphere so you can Reaper's Scythe a target.",
      "Mechanically, Agh's Shard Death Seeker hides your hero at the casting location and then moves you to the targeted location once the projectile lands. You're basically Puck Phase Shifted while the Death Seeker projectile is flying.The ending location is determined on cast, so the targeted enemy moving around won't change where the Death Seeker takes you.You remain hidden/untargetable and invulnerable throughout the movement. The invulnerability is relevant because if you're Ruptured by Bloodseeker, you can Death Seeker somewhere without taking any damage. The hide is relevant because spells that go through invulnerability, like Silencer's Global Silence, won't be able to target you since you're hidden.You can use Death Seeker to avoid spells like Disruptor's Glimpse and Kunkka's X Marks, or go through Disruptor's Kinetic Field and Mars's Arena.",
      "The ending location is determined on cast, so the targeted enemy moving around won't change where the Death Seeker takes you.",
      "You remain hidden/untargetable and invulnerable throughout the movement. The invulnerability is relevant because if you're Ruptured by Bloodseeker, you can Death Seeker somewhere without taking any damage. The hide is relevant because spells that go through invulnerability, like Silencer's Global Silence, won't be able to target you since you're hidden.",
      "You can use Death Seeker to avoid spells like Disruptor's Glimpse and Kunkka's X Marks, or go through Disruptor's Kinetic Field and Mars's Arena."
    ],
    "counter_tips": [
      "You can't disjoint Death Pulse, so don't bother trying.",
      "Pipe or Glimmer Cape's magic damage barrier can potentially save an ally's life against Reaper's Scythe.",
      "Dazzle's Shallow Grave, Oracle's Fate's Edict and False Promise, and heroes that can banish a Scythed target like Shadow Demon, Outworld Destroyer, and Tusk are also good counters. A well-timed Bane Nightmare provides momentary invulnerability as well.",
      "You can potentially use Wind Waker on an ally being Scythed to save them.",
      "Ghost Shroud can be dispelled the same ways as Ghost Scepter (Oracle's Fortune's End, Shadow Demon's Demonic Purge, Enchantress's Enchant, etc).",
      "If you're a carry and you're struggling to right click because of Ghost Shroud, you can get a Nullifier to dispel the ethereal state off.",
      "Necro is taking bonus magic damage whenever he's in Ghost Shroud, so try to bait it out before tossing high magic damage nukes.",
      "The HP regen Necrophos gains from his Sadist innate can be reduced by debuffs that affect Health Restoration:Items that can reduce health restoration: Spirit Vessel, Orb of Frost/Corrosion, Skadi, Shiva's Guard, and the \"Crippling Crossbow\" and \"Jidi Pollen Bag\" neutral item artifacts.Spells that can reduce health restoration: Ancient Apparition's Ice Blast, Broodmother's Spin Webs with \"Necrotic Webs\" facet, Doom's Doom, Dragon Knight's \"Frost Dragon\" facet, Drow Ranger's Agh's Scepter Hypothermia, anda few others.",
      "Items that can reduce health restoration: Spirit Vessel, Orb of Frost/Corrosion, Skadi, Shiva's Guard, and the \"Crippling Crossbow\" and \"Jidi Pollen Bag\" neutral item artifacts.",
      "Spells that can reduce health restoration: Ancient Apparition's Ice Blast, Broodmother's Spin Webs with \"Necrotic Webs\" facet, Doom's Doom, Dragon Knight's \"Frost Dragon\" facet, Drow Ranger's Agh's Scepter Hypothermia, anda few others.",
      "Necro loves playing against heroes who frequently give Stick charges, especially in lane. Try casting spells from fog since Magic Stick only gives charges if the spell caster is in vision.",
      "Necro can't cast Agh's Shard Death Seeker while rooted/leashed."
    ]
  }
}