{
  "name": "Primal Beast",
  "safe_name": "primal_beast",
  "strategies": {
    "general_tips": [
      "Onslaught movement can be canceled at any point using the 'stop' hotkey.",
      "If you want a very short and quick Onslaught, don't use the spell hotkey to cancel the wind up animation. Instead, use your 'stop' hotkey to immediately cancel the wind up. This bypasses the mini-cooldown the spell goes on to prevent accidental mashing.If you shift+queue Onslaught and a stop command during Pulverize, an enemy won't even be able to BKB in between the spells.You can layer Agh's Shard Rock Throw on top for evenMORE chain stunning.",
      "If you shift+queue Onslaught and a stop command during Pulverize, an enemy won't even be able to BKB in between the spells.",
      "You can layer Agh's Shard Rock Throw on top for evenMORE chain stunning.",
      "Onslaught will bump enemies and allies in your path. The bump does not disable allies nor cancel their channels.You can use this bump to push allies out of things like Disruptor's Kinetic Field or Slark's Pounce leash.",
      "You can use this bump to push allies out of things like Disruptor's Kinetic Field or Slark's Pounce leash.",
      "You can slightly influence the direction of an Onslaught by right clicking where you want to steer it. It doesn't change your angle too much, but it's better than nothing.",
      "Enemies can hear all of your Onslaught sound effects, even through fog, if their camera is in the vicinity of your hero. Basically, if an enemy is in your Onslaught AoE, they'll definitely hear you starting the cast.",
      "Onslaught will freely path you over cliffs and trees. You'll destroy any trees in your way.",
      "You can Onslaught along the edges of the map for a few seconds of high ground vision.",
      "You can cast items without turning to the target during the wind up of Onslaught.",
      "You can cast non-targeted spells and items at any point in Onslaught without canceling the charge. This means you can activate Trample at any point during Onslaught and keep moving.Casting targeting items will immediately cancel the charge.",
      "Casting targeting items will immediately cancel the charge.",
      "Trample destroys trees you walk over.",
      "Trample won't proc while you're being moved from Force Staff.",
      "Trample will proc a few times while spinning in a Eul's cyclone. Even more during a Wind Waker if you're moving around.",
      "The \"Cannot be slowed or rooted during Trample\" talent can be activated while these debuffs are applied to you and your hero will ignore them, but it won't dispel the debuff.The talent bypasses roots, but leashes won't be ignored.",
      "The talent bypasses roots, but leashes won't be ignored.",
      "You can activate Trample or Uproar while channeling, such as when channeling Onslaught, Pulverize, or a TP.",
      "You gain Uproar stacks from damage applied by heroes or player owned summons.Even allied hero damage works. If you have an Oracle on your team, Purifying Flames will add Uproar stacks.",
      "Even allied hero damage works. If you have an Oracle on your team, Purifying Flames will add Uproar stacks.",
      "While Uproar is active, you won't build new stacks.",
      "Each line from Agh's Scepter Uproar can damage an enemy, similar to Shadow Fiend's Requiem. So if you're standing right on top of someone with Trample or during Pulverize, they'll get hit by every line.",
      "Agh's Shard Rock Throw split fragments will travel in the opposite direction of your hero when the first Rock lands. It has nothing to do with the original direction you threw the first Rock. Therefore, if you blink while the first Rock is in the air, you canmodify the angle of the fragmented rocks.",
      "Agh's Shard Rock Throw builds Uproar stacks for each hero hit by a Rock. It counts illusions and creep-heroes as valid targets to add Uproar stacks.",
      "You can pollute the map with Agh's Shard Rocks by moving somewhere and shift+queueing Rock Throw on precisely the same spot you're walking to without moving your mouse at all. You'll throw a Rock that'll just vibrate in the air without ever touching the ground. Completely useless, but great at irritating people.",
      "Pulverize ignores status resistance.",
      "The AoE bonuses provided by the \"Ferocity\" facet fully stack if Pulverize is refreshed and cast again.The \"Pulverize Duration\" talent also increases the number of AoE buffing stacks.",
      "The \"Pulverize Duration\" talent also increases the number of AoE buffing stacks."
    ],
    "counter_tips": [
      "If you're touching a high/low ground cliff, Primal may push you to the other level of terrain with the Onslaught bump. Try hugging a cliff if he's about to run you over.",
      "Primal Beast can't cast Onslaught while rooted/leashed.If he's already in the middle of the wind up animation for Onslaught, roots will cancel it. If leashed, he'll just run in place, but beware that he'll still have the stun AoE around him.",
      "If he's already in the middle of the wind up animation for Onslaught, roots will cancel it. If leashed, he'll just run in place, but beware that he'll still have the stun AoE around him.",
      "Most disables can cancel Onslaught while Primal is moving and even during the wind up animation.Even Force Staff, Harpoon, and other sources offorced movement or knockbackcan end Onslaught prematurely.Silences won't cancel an Onslaught that's already started winding up.",
      "Even Force Staff, Harpoon, and other sources offorced movement or knockbackcan end Onslaught prematurely.",
      "Silences won't cancel an Onslaught that's already started winding up.",
      "Onslaught movement can be canceled by applying dispels on Primal while he's galloping. Spells like Enchantress's Enchant, Techies' Reactive Tazer explosion, Shadow Demon's Demonic Purge, or Nullifier can stop him in his tracks mid-Onslaught. These dispels have to be appliedafterhe starts moving, though. They won't cancel while he's winding up Onslaught.",
      "The Uproar active buff can be dispelled off Primal Beast.",
      "You can dispel the break debuff from Agh's Scepter Uproar, but new lines will immediately reapply it.",
      "Pulverize is a channeled disable, so stunning or silencing Primal Beast during the channel will end the spell.",
      "Lotus Orb prevents Primal Beast from casting Pulverize on a target without it getting canceled instantly.",
      "Primal Beast will stop Pulverizing if he's affected by forced movement or knockbacks. So don't Force Staff your ally if they're getting their head smashed in, Force Primal instead.",
      "Clockwerk makes life extremely unpleasant for Primal Beast with how often he can stun and interrupt Primal's spells.",
      "Glyphing the creep wave can be an effective way to annoy a Primal Beast who's trying to quickly clear a wave mid with Trample."
    ]
  }
}