{
  "name": "Shadow Fiend",
  "safe_name": "shadow_fiend",
  "strategies": {
    "general_tips": [
      "Cancel your Razes. The cast time is long, so if you know you're going to miss, hit the stop key.",
      "Landing multiple Razes adds stacking amounts of damage on enemy targets and Roshan. Each Raze landed refreshes the debuff.",
      "Landing multiple Razes on a hero can sometimes be challenging when the game's pathing doesn't cooperate. A handy console command to work around this is:cl_dota_alt_unit_movetodirection trueThis command makes it so that whenever you're holding down ALT, your hero ignores pathing and tries to move in a straight line towards where you right clicked. You can also enable the \"Directional Move\" hotkey in the settings, but this ALT modifier may be easier to use once you get used to it.",
      "You can try to mask some of the Shadow Raze cast animation while turning. If you're facing one direction, click where you want to angle the Raze and immediately hit the spell hotkey. Your hero will already begin the Raze cast animation while you're spinning giving the enemy less time to react. For a full 180°, nearly half the cast animation will be complete by the time you finish turning.",
      "Shadow Fiend is one of the most useful heroes to learnTread switchingon since he can make use of all three attributes and frequently gets a Bottle.",
      "If you're having a hard time in lane, go head to the nearest jungle camp and Raze it down for quick innate Necromastery souls for more damage.",
      "The \"Shadowraze Applies Attack Damage\" talent basically adds aninstant attackon top of each Raze. This instant attack ignores disarms, has true strike, and applies attack modifiers. If you have an attack modifier with a proc, it'll roll for a chance to proc on each target hit in the Shadowraze AoE.Since an instant attack is being applied, Shadowraze will break your Smoke if it damages a unit with this talent.",
      "Since an instant attack is being applied, Shadowraze will break your Smoke if it damages a unit with this talent.",
      "Presence of the Dark Lord does not affect enemies who don't have vision of you. Therefore, you can click on enemies and look if they have the Presence debuff to check if they can see you or not.",
      "You can use a 'stop' command to cancel your Requiem of Souls cast animation without putting it on cooldown.",
      "The entire Requiem of Souls cast animation remains hidden under an invis rune or Shadow Blade invisibility. This is because beginning a cast animation doesn't remove invisibility, invis only gets removed once a spell (or attack) is triggered.",
      "Unlike most other fears, Requiem fears enemies away from Shadow Fiend, rather than towards their fountain.Try to use the Requiem fear to set up easy triple Razes on a target who's running in a predictable fixed direction.",
      "Try to use the Requiem fear to set up easy triple Razes on a target who's running in a predictable fixed direction.",
      "Agh's Scepter upgraded Requiem will also fear enemies when the lines return."
    ],
    "counter_tips": [
      "Don't forget that he mini-Requiems when he die--too late, you ate it.",
      "Remember that SF loses some of his innate Necromastery souls on death. So if he just respawned or bought back, he's not going to be attacking at full power.",
      "The Requiem slow and fear debuff can be dispelled with basic dispels.",
      "The Feast of Souls buff can be dispelled off Shadow Fiend. His hands start glowing red when the spell is active."
    ]
  }
}