{
  "name": "Shadow Shaman",
  "safe_name": "shadow_shaman",
  "strategies": {
    "general_tips": [
      "Your Fowl Play innate will not protect you from a lethal Axe Culling Blade or Necrophos Reaper's Scythe.It will protect you from a lethal amount of damage after Oracle's False Promise ends, though.",
      "It will protect you from a lethal amount of damage after Oracle's False Promise ends, though.",
      "Ether Shock can hit secondary units almost twice as far away than the spell's cast range. If an enemy is making a run for it and is just out of cast range, try casting the Shock on the ranged creep right behind them to possibly hit them. Ether Shock won't bounce to units that are in fog, however.",
      "Ether Shock chooses secondary targets in a cone in front of Shadow Shaman.Secondary targets are always the closest available units to the primary target.",
      "The facts on Hex: Instant cast time, insta-kills illusions (but not 'strong' illusions), and is super annoying. Spam cast and cancel this spell on the enemy team's initiator when you're toeing off. The moment they Blink in and are in range, they'll be Rhasta Fried Chicken.Hexes are effectively casting a silence, a mute, and a slow on enemies. Some enemies can cast spells while stunned (like Abaddon with Borrowed Time), but can't during a hex because they're silenced.All Hex interactions are consistent for enemies attacked by the \"Chicken Fingers\" facet.",
      "Hexes are effectively casting a silence, a mute, and a slow on enemies. Some enemies can cast spells while stunned (like Abaddon with Borrowed Time), but can't during a hex because they're silenced.",
      "All Hex interactions are consistent for enemies attacked by the \"Chicken Fingers\" facet.",
      "An enemy willalwaysbe able to activate BKB in-between Shackle and Hex. Lead with Hex during ganks, especially since Hex has no cast animation and also has longer range.",
      "Shackles provides true sight on the target.",
      "You can cast Agh's Scepter Shackles on any couriers on your team and use them as Ether Shocking drones. Just be aware of the break distance.",
      "Agh's Scepter Shackles Ether Shocks can hit enemies in fog and you can even trace the particles to see where they are.",
      "Don't let enemies farm your Serpent Wards for free after they win a team fight. It only takes a few attacks from a hero to kill a Ward. Select one lone Ward in the back and have it murder its siblings with a deny when they're down to 1 HP.",
      "You can trap enemies inside your Wards by targeting the circle directly onto a hero.",
      "If you take the \"Massive Serpent Ward\" facet, the prior multi-Serpent Ward tips are not applicable.",
      "Serpent Wards are controllable units. Be sure to keep Wards focused on your most important target, like the enemy tower, before they got distracted in a team fight.",
      "Serpent Wards can attack other types of ward units, like Pugna's Nether Ward or Undying's Tombstone.",
      "Serpent Wards have 1200/800 day/night vision.",
      "Tier 1 towers never have backdoor protection enabled, only Tier 2 onwards have it. Keep this in mind if you want to sneak a quick Tier 1 tower with Serpent Wards without a creep wave.",
      "Sentry wards can tanktenhits from a tower before they die. If you're trying to sneakily take a tower and you really want to make sure it goes down, consider plopping down a sentry ward to draw the tower's aggro and then casting Serpent Wards. I guess you could also burn an observer ward for this strat, but you better have a huge lead if you're doing that."
    ],
    "counter_tips": [
      "If you're trapped in a circle of Serpent Wards, you can Phase through the Serpents using Phase Boots or certain invis abilities.",
      "Damage block doesnotmitigate Serpent Ward damage. All ward-type units ignore damage block.",
      "Casting Serpent Wards costs a ton of mana, making Shaman a great candidate for mana burning or Pugna Nether Warding against.",
      "Illusion attacks count as hero attacks against Serpent Wards.",
      "You can break these cuffs. Always have a stun/silence ready on your team to bail a teammate out from the Shackle channel.Banishes can also free allies from channeled disables, like Shackles.",
      "Banishes can also free allies from channeled disables, like Shackles.",
      "Lotus Orb can help discourage Shadow Shaman from chain disabling allies.",
      "Keep a Blood Grenade handy in lane to finish off a Shadow Shaman who may otherwise narrowly escape with Fowl Play. Just be sure to cast it after the innate procs because it also dispels him on trigger.",
      "Breaks can disable Shadow Shaman's Fowl Play innate.Breaks can be provided with items like Silver Edge or Khanda. Spells that Break include Hoodwink's Sharpshooter, Naga Siren's Agh's Scepter Ensnare, Phantom Assassin's Agh's Scepter Fan of Knives, Shadow Demon's Agh's Scepter Demonic Purge, Viper's Viper Strike, anda few others.",
      "Breaks can be provided with items like Silver Edge or Khanda. Spells that Break include Hoodwink's Sharpshooter, Naga Siren's Agh's Scepter Ensnare, Phantom Assassin's Agh's Scepter Fan of Knives, Shadow Demon's Agh's Scepter Demonic Purge, Viper's Viper Strike, anda few others.",
      "A lethal Axe Culling Blade or Necrophos Reaper's Scythe can kill Shadow Shaman through his Fowl Play innate."
    ]
  }
}