{
  "name": "Skywrath Mage",
  "safe_name": "skywrath_mage",
  "strategies": {
    "general_tips": [
      "Arcane Bolt gives vision as it travels. This is useful when enemies are in fog as you can use the brief vision before impact to get in one auto-attack if the enemy is hiding in trees or on high ground.The vision provided by Arcane Bolt on impact can also help land a Concussive Shot since Concussive can only fly to heroes if you have vision of them.",
      "The vision provided by Arcane Bolt on impact can also help land a Concussive Shot since Concussive can only fly to heroes if you have vision of them.",
      "Be aware that enemies only get Stick charges if the caster of a spell is in vision. If you're spamming Arcane Bolt against enemies with Sticks, try to cast while hiding in tree fog.",
      "Concussive Shot has zero cast time. If you have the mana, always cast it if you're getting chased.",
      "Concussive Shot will never select illusions to hit. If you're against a hero who uses a lot of illusions, save Concussive for when you want to find the real one.",
      "If there are no heroes in range, Concussive Shot will instead hit the nearest creep.",
      "Ancient Seal is the only single-targeted instant (zero cast time) silence in the game besides Orchid. The magic amplification is nice and all, but a guaranteed targeted silence is what makes this skill amazing. Cast+cancel this constantly on enemy initiators before a team fight so you can instantly silence them when they try Blinking into your team.",
      "If you are free-balling a Mystic Flare, prediction and practice are your best bets to landing it consistently. You want the enemy to walk into the middle of the Flare half a second after you cast and then think to themselves, \"Well, great, now it doesn't matter which direction I walk, I'm eating this ult.\"",
      "Mystic Flare damage works on Rosh.",
      "Mystic Flare damage instantly kills illusions.",
      "After picking up an Agh's Scepter, your spells will randomly search around your primary target for additional targets that are not in fog, prioritizing heroes.If you have the \"Global Concussive Shot\" talent, both Shots will search globally. The first Shot will hit the closest target like normal, but the second shot will pick another global target at random.",
      "If you have the \"Global Concussive Shot\" talent, both Shots will search globally. The first Shot will hit the closest target like normal, but the second shot will pick another global target at random.",
      "Agh's Scepter multicasts also bypass things like Linken's Sphere or Lotus Orb. Since heroes are prioritized as secondary targets, you can fairly reliably cast Ancient Seal on solo heroes with Linken's by casting the silence on a nearby creep.",
      "Agh's Scepter Mystic Flare attempts to place the secondary Mystic Flare on the center of a nearby hero. However, if there's already a Mystic Flare AoE on the center of a hero, it won't place a second one on top. So if you're trying to hit a single hero with double Mystic Flares, target your first Flare so that the edge of the AoEdoes not coverthe middle of the enemy. If placed correctly, you should be able to hit a single hero with two Mystic Flares."
    ],
    "counter_tips": [
      "Avoid trying to outrun Arcane Bolt unless you have some plan to not die to it. It's going to hit you regardless, all you're doing is giving the enemy team a tiny little ward that's giving away your location as you run.",
      "You can quickly move a Raindrop into your backpack to protect charges from weak Arcane Bolts.",
      "If Skywrath is spamming Arcane Bolt, get a Magic Stick. Just be aware that the Stick only gets charges if you have vision on the hero when they cast a spell.",
      "After Skywrath blows his mana load spamming spells at level 1, he'll probably start sipping Clarities in the corner like a junkie. Don't let him.",
      "Concussive Shot has a small AoE on impact. Avoid clumping up around the target that Concussive Shot is tailing.",
      "Concussive Shot can only target you if Skywrath has vision of you. Try utilizing fog from trees when getting chased by Sky.If you get hit by a random Concussive in the late game, it's possible Skywrath took the \"Global Concussive Shot\" talent and cast the spell when you were walking under some wards.",
      "If you get hit by a random Concussive in the late game, it's possible Skywrath took the \"Global Concussive Shot\" talent and cast the spell when you were walking under some wards.",
      "Beware of the Mystic Flare combos on the enemy team. Nature's Prophet's Sprout or Clockwerk's Power Cogs may be annoying spells by themselves, but they become killboxes with a Skywrath. If this is a concern, get a Force Staff or Eul's.",
      "If Skywrath gets a Rod of Atos and is rooting you into Mystic Flare combos, remember that the Rod root can be dispelled by items like Manta Style, Satanic, Guardian Greaves, Lotus Orb, or Disperser.",
      "Oracle with Fate's Edict providing magic damage immunity can be annoying for Skywrath to deal with.",
      "Pugna can be a real pain for Skywrath because all of his spells cost a ton of mana and Nether Ward hurts."
    ]
  }
}