{
  "name": "Snapfire",
  "safe_name": "snapfire",
  "strategies": {
    "general_tips": [
      "With the \"Ricochet II\" facet, glancing shots from Snapfire's Buckshot innate will search around the primary target for secondary targets using Snapfire's attack range. This ricochet distance increases if your attack range increases.Ricochet II attacks can apply any attack modifiers your hero has.",
      "Ricochet II attacks can apply any attack modifiers your hero has.",
      "Firesnap Cookie can't target allies who are channeling spells or items. The Cookie also has no effect on banished allies.",
      "Allies can't disjoint the Firesnap Cookie if they blink, it'll follow them everywhere. Grandma's gotta feed you.",
      "Casting Firesnap Cookie on allies will interrupt any cast animations they're in the middle of.",
      "Firesnap Cookie's bounce allows targets to pass over cliffs.",
      "Firesnap Cookie will move allies even if they're rooted.Cookie can technically move allies who are leashed, but it won't move them beyond the limits of the leash to break it (like from Slark's Pounce or Grimstroke's Soulbind). It also cannot free allies from an enemy Disruptor's Kinetic Field.Firesnap Cookie does nothing when cast on an ally in Enigma's Black Hole or Faceless Void's Chronosphere, it just wastes the cooldown.",
      "Cookie can technically move allies who are leashed, but it won't move them beyond the limits of the leash to break it (like from Slark's Pounce or Grimstroke's Soulbind). It also cannot free allies from an enemy Disruptor's Kinetic Field.",
      "Firesnap Cookie does nothing when cast on an ally in Enigma's Black Hole or Faceless Void's Chronosphere, it just wastes the cooldown.",
      "If an ally gets affected by forced movement or knockback mid-Cookie jump, they'll immediately drop straight down and stun the area underneath their hero. Theoretically, you could Force Staff an ally right after they start bouncing from the Cookie to instantly proc the stun.If a target dies mid-Cookie jump, their corpse will also drop down immediately and stun the ground.",
      "If a target dies mid-Cookie jump, their corpse will also drop down immediately and stun the ground.",
      "Firesnap Cookie destroys trees in a small radius around the target's landing location.",
      "Consider tossing Firesnap Cookie on creeps to get stuns on enemy heroes. Creeps have more predictable pathing than your allied heroes do and enemies may not think to retreat from a creep wave.",
      "Lil' Shredder attacks can apply any attack modifiers your hero has.",
      "Each Lil' Shredder attack counts as a hero attack against ward units. This is very useful against heroes like Phoenix with Supernova, Shadow Shaman with Serpent Wards, Undying with Tombstone, Clockwerk with Power Cogs, Pugna with Nether Ward, or Zeus with Nimbus.",
      "Each Lil' Shredder attack refreshes the armor reduction debuff on a target. You can minmax this by delaying using your last Shredder attack to extend the minus armor debuff on a target for as long as possible.",
      "Mortimer Kisses projectiles give vision as they fly and lingering vision wherever they land.",
      "You can cancel Mortimer Kisses early by issuing a stop command.",
      "If you Agh's Scepter Gobble Up a Pangolier in Rolling Thunder, he'll stun everything on the way to the target location.",
      "You can Agh's Scepter Gobble Up enemy or neutral creeps, including enemy summons (but not creep-heroes). However, Spit Out counts as a deny, so you don't get any gold bounty from Gobbling units.",
      "The cast range on Agh's Scepter Spit Out is the same as the cast range on Mortimer Kisses.",
      "Respect the z-axis when casting Agh's Scepter Spit Out. If your Spit trajectory sends a hero over a cliff, they may end up landing on the cliff instead of the targeted AoE."
    ],
    "counter_tips": [
      "Applying forced movement or knockback on a target that is being bounced with Firesnap Cookie will make them immediately hit the ground and stun the area underneath them. You can use this to cut a Cookie jump short with spells like Drow Ranger's Gust or Lich's Sinister Gaze.",
      "Both the Lil' Shredder buff on Snapfire and the minus armor debuff can be removed with basic dispels.",
      "Most types of disables will cancel the Mortimer Kisses cast. Some exceptions that don't cancel the cast: Disruptor's Glimpse, Vengeful Spirit's Nether Swap, or any roots/leashes.One notable long range Kiss-cancel is Sniper's Assassinate. Get vision with Shrapnel, then Assassinate her to end her Kiss cast.",
      "One notable long range Kiss-cancel is Sniper's Assassinate. Get vision with Shrapnel, then Assassinate her to end her Kiss cast.",
      "Nyx Assassin can walk into any glob puddle, activate Spiked Carapace, and instantly cancel the Mortimer Kisses cast.",
      "There is a minimum allowed range on Kiss targeting. If you walk into melee range of Snapfire, she can't get any Kisses on you.",
      "If you're trying to escape from long range Kisses, activate a Smoke to potentially escape Snap's vision."
    ]
  }
}