{
  "name": "Techies",
  "safe_name": "techies",
  "strategies": {
    "general_tips": [
      "Sticky Bombs will always latch to the nearest hero upon landing.",
      "Sticky Bombs provide a small radius of ground vision when they're spinning around or once they attach to an enemy. You can try throwing a Sticky Bomb on a cliff to scout for wards.",
      "Sticky Bombs destroy trees in a tiny radius around the target point.",
      "You can manually detonate Reactive Tazer by pressing the spell hotkey again during the buff.",
      "Any enemy that gets hit with the Reactive Tazer debuff will also receive a basic dispel.",
      "Reactive Tazer disarm works on Roshan.",
      "Each time a target attacks you, they'll receive the Reactive Tazer damage. This usually can't happen that often during a single cast, but certain multi-attack spells like Pangolier's Swashbuckle can have him tank multiple Reactive Tazer nukes in just one cast.",
      "If you're banished while flying in Blast Off, the spell will still land on the target area as expected, but you won't take the self-damage.",
      "Respect the z-axis when casting Blast Off. If your Blast Off's downwards trajectory arcs over a cliff, you may end up landing on the cliff instead of your targeted AoE.",
      "You can use Blast Off to escape a Disruptor's Kinetic Field.",
      "If you plant a Proximity Mine directly underneath yourself after Blasting Off into some enemies, they may struggle to right click it underneath your hero model.Even more frustrating is if they try to destroy your mine while your Reactive Tazer is on because then they'll also get disarmed for trying.",
      "Even more frustrating is if they try to destroy your mine while your Reactive Tazer is on because then they'll also get disarmed for trying.",
      "All placed Proximity Mines will dynamically level up as more points are put into the spell.",
      "Proximity Mines deal damage to buildings. However, remember that Proximity Mines deal less damage the further they are away from the target, so try to place Mines as close to the tower as possible.",
      "Towers won't ever attack Proximity Mines.",
      "Agh's Scepter Minefield Sign can trigger on enemy illusions.",
      "Spell damage amplification from items like Kaya does not boost Proximity Mine damage since the Mine itself is the source of the damage as a separate ward unit, not your hero.This also explains why heroes who Blade Mail on your Mines won't deal damage to your hero.",
      "This also explains why heroes who Blade Mail on your Mines won't deal damage to your hero.",
      "Take advantage of dropping/backpacking INT/mana items to get more effective regen when you use Soul Ring or Arcane Boots."
    ],
    "counter_tips": [
      "Any type of attack that lands on Techies with Reactive Tazer active will disarm you. This includesinstant attacksfrom spells. So if a Monkey King Boundless Strikes a Tazer'd Techies, he'll get disarmed. If a Phantom Assassin Stifling Dagger's a Tazer'd Techies, she'll get disarmed. If a Medusa Split Shot lands on a Tazer'd Techies... she actually won't get disarmed for some reason. She will if she has her Agh's Scepter Split Shot, though. Basically, if the instant attack can also proc attack modifiers, you'll get disarmed. Dota 2, amirite?Oh, one more note! If your instant attack also banishes you, like Ember Spirit's Sleight of Fist or Riki's Tricks of the Trade, then you won't get disarmed.",
      "Oh, one more note! If your instant attack also banishes you, like Ember Spirit's Sleight of Fist or Riki's Tricks of the Trade, then you won't get disarmed.",
      "If you get hit with the Electric Tazer debuff, your hero will also receive a basic dispel which will remove most buffs.",
      "Techies turns brighter and more... electrick-y when Reactive Tazer is about to pop.",
      "If you dispel the Reactive Tazer buff off an enemy, it'll immediately detonate and disarm everything in the AoE.",
      "Don't listen to music when you're playing against Techies. Proximity Mines make a noise when you walk into the trigger AoE, even through fog.",
      "Invisible and flying units can trigger and be damaged by Proximity Mines.",
      "Proximity Mines are invisible once armed until you walk into their AoE. Even Gem/sentry wards can't spot them.",
      "Proximity Mines only take one attack to be destroyed.SO PLEASE. ATTACK. THE MINE.Especially,as a carry. Your attack speed is way higher than a support, so you have a much better chance of killing the Mines before they fully arm and explode.",
      "Damage absorbed from Proximity Mines during Blade Mail does not reflect onto Techies. This is because the Proximity Mine ward unit itself is the source of damage, not Techies. This is also why applying Mage Slayer onto Techies will not reduce Proximity Mine damage.",
      "Attack+moving willnottarget Proximity Mines. You have to manually right click each one to attack them.",
      "Stuns and other disableswon'tstop a Techies that's in flight from a Blast Off, but sources offorced movement or knockbackscan. This means cycloning or Force Staffing or Harpooning a Techies that's Blasting Off will cancel the explosion.Spells that move the enemy with vertical forced movement or knockback, like Sand King's Burrowstrike, Nyx's Impale, Lion's Earth Spike, and Rubick's Telekinesis, or horizontally, like Drow Ranger's Gust, Keeper of the Light's Blinding Light, and Storm Spirit's Electric Vortex, will also cancel the explosion.Fears like Lich's Sinister Gaze or Lone Druid's Savage Roar can also cancel a flying Blast Off.",
      "Spells that move the enemy with vertical forced movement or knockback, like Sand King's Burrowstrike, Nyx's Impale, Lion's Earth Spike, and Rubick's Telekinesis, or horizontally, like Drow Ranger's Gust, Keeper of the Light's Blinding Light, and Storm Spirit's Electric Vortex, will also cancel the explosion.",
      "Fears like Lich's Sinister Gaze or Lone Druid's Savage Roar can also cancel a flying Blast Off.",
      "Techies can do very little when getting hit by Clockwerk's Battery Assault since his cast animations take so long.",
      "Avoid standing close to treelines when pushing against Techies. It's a favorite area for hidden Proximity Mines.",
      "Techies players loooove going for offensive Force Staff plays, so be very wary if you see that item in his inventory.",
      "Be very careful when walking up any high ground stairs since there may be a Proximity Mine or two hiding just outside your vision.",
      "All of Techies' damage is magical, so items like Glimmer Cape or Pipe can improve your survivability.",
      "Infused Raindrops can give you some very valuable early game survivability against a Techies."
    ]
  }
}