{
  "name": "Tinker",
  "safe_name": "tinker",
  "strategies": {
    "general_tips": [
      "Laser's 100% blind is a big deal. Early game, you can keep it in your pocket for when a right click hero dives you.",
      "Laser's blind works on Rosh.",
      "The Agh's Scepter Shrink Ray debuff on Laser is linked to the blind debuff and will last the same amount of time.",
      "You want to cast March of the Machines diagonally to the creep wave to ensure that the little Machines have the highest probability of colliding with creeps.Confused? Let Merlini explain.",
      "Defense Matrix buffs are removed whenever the barrier is lost.With the \"Translocator\" facet, you will not get the dispel and blink if your Defense Matrix is dispelled. You only get it if the barrier gets fully consumed.",
      "With the \"Translocator\" facet, you will not get the dispel and blink if your Defense Matrix is dispelled. You only get it if the barrier gets fully consumed.",
      "Avoid drying yourself out of mana every time you TP on the lane in the late game. Keep mana in the bank to deal with a Rearm or Keen Conveyance getting canceled.",
      "Remember to shift+queue your Blink Dagger while you're Keen Conveying onto a creep. That split second of targeting your Blink after you teleport in could get you killed.",
      "You probably want to have your auto-attack setting on 'Never' when playing Tinker. This reduces your chances of revealing yourself in trees with an errant auto attack onto a nearby lane creep.You can also get in the habit of shift+queueing a stop command after Blinking into trees.",
      "You can also get in the habit of shift+queueing a stop command after Blinking into trees.",
      "Take advantage of the few seconds of residual fountain aura when you Keen Conveyance back onto the map. If you're fast, you should be able to use a spell or two and then activate a Bottle charge and have it replenished immediately.",
      "Don't make life hard for your carry. You have the ability to be in all three lanes whenever you want, but you also have the ability to bail at a moment's notice. Much like Nature's Prophet with his Teleportation, Tinker's job is to farm the dangerous locations on the map that other heroes can't. So stay out of the lane that your carry is trying to farm.",
      "Try and fake Keen Conveyance on nearby targets to scare enemies off chasing your allies even when you don't want to commit.",
      "If you target Keen Conveyance on an invisible ally, enemies will see your TP silhouette on wherever the ally was when you initiated the TP. The silhouette won't dynamically update its position, however, it'll visually stay at that initial point until your TP completes.",
      "You can target Keen Conveyance onto an ally Underlord's Fiend's Gate.",
      "Youcannottarget Keen Conveyance onto allyward units(like Venomancer's Plague Wards or Clockwerk's Power Cogs).",
      "You can activate a Shiva's Guard while TPing or channeling Keen Conveyance. It takes ~2 seconds for the Blast to fully extend, so cast it after the first second of a TP channel to arrive with an expanded Blast.",
      "Dagon can instakill most enemy illusions, but not 'strong' illusions like Vengeful Spirit's Agh's Scepter Vengeance illusion.",
      "In late game situations, remember that Glyph provides invulnerability on your creeps when used. If you need to Keen Conveyance into a fight or want to bait an enemy into attempting to kill a creep, you could use Glyph offensively to save the creep.",
      "Rubick can't steal Rearm.",
      "Agh's Shard Warp Flare roots enemies allowing you to cancel TPs.",
      "Harpoon's projectile cannot be disjointed. However, you can Blink during the Harpoon pull. So, if you see someone trying to Harpoon you, wait untilafterthe projectile connects before Blinking."
    ],
    "counter_tips": [
      "For some reason, lane creeps drop aggro off of an enemy creep if there is a someone TPing onto it. So it's up to you to kill the creep to prevent Tinker's Keen Conveyance channel.",
      "Certain abilities can instakill creeps even if they're Glyphed or protected by Roshan's Banner. These include: Doom's Devour, Mirana's Sacred Arrow, Night Stalker's Agh's Shard Hunter in the Night, Pudge's Meat Hook, Hand of Midas, and Dagon. These can be handy to remember in a late game situation if Tinker Glyphs a creep wave while traveling on to it.",
      "Laser's blind can be dispelled off. Or just get BKB or MKB to mitigate the blind.",
      "March of the Machines deals damage based on the little robots colliding with an enemy unit. They get consumed and deal damage when they hit a unit, so if you stand downstream of the March behind creeps or summons, you can avoid March damage. You can also just walk between them to avoid the damage.",
      "The Defense Matrix buff can be removed off enemies with basic dispels, like from Nullifier.If Tinker takes the \"Translocator\" facet, you can dispel the Defense Matrix off him and he won't get the blink and dispel from the facet.",
      "If Tinker takes the \"Translocator\" facet, you can dispel the Defense Matrix off him and he won't get the blink and dispel from the facet.",
      "Roots/leashes will prevent Tinker from blinking with the \"Translocator\" facet.",
      "Lotus Orb can be invaluable against the mostly single target damage builds a lot of Tinkers go for.",
      "Harpoon's active is undisjointable. So if you toss the 'poon at Tinker before he Blinks, the projectile will still follow him and drag him to you.",
      "Tinker's Agh's Shard Warp Flare projectile can be disjointed.",
      "Clockwerk can be a fairly good counter since he can get vision of Tinker in the trees with Rocket Flare and initiate on him from a far distance.",
      "Zeus's Agh's Scepter Nimbus is basically a global instant stun. That's pretty value against a Tinker.",
      "You can consider Dominating a Harpy Scout and flying it over treelines to potentially give vision of an unwitting Tinker.",
      "Remember that unlike most TPs, Keen Conveyance is a spell. As a result, silences can cancel Tinker's Keen Conveyance TP."
    ]
  }
}