{
  "name": "Vengeful Spirit",
  "safe_name": "vengeful_spirit",
  "strategies": {
    "general_tips": [
      "Your \"Soul Strike\" facet allows items/spells to give you all the benefits of being a melee hero while also taking advantage of ranged hero interactions.Range increasing items, like Dragon Lance or the \"Vast\" neutral item enchantment, will increase your attack range.Hurricane Pike will work as expected as it does on a ranged hero. Echo Sabre will work as expected as it does on a melee hero.Your attacks can cleave. Your attacks can't miss uphill.Items that give you different proc chances or values on melee heroes will roll for the melee version, like Basher.Phase Boots will give you the melee hero move speed buff. Heaven's Halberd will disarm you for the melee hero duration.Really the only melee hero attribute you don't benefit from is damage block rules.",
      "Range increasing items, like Dragon Lance or the \"Vast\" neutral item enchantment, will increase your attack range.",
      "Hurricane Pike will work as expected as it does on a ranged hero. Echo Sabre will work as expected as it does on a melee hero.",
      "Your attacks can cleave. Your attacks can't miss uphill.",
      "Items that give you different proc chances or values on melee heroes will roll for the melee version, like Basher.",
      "Phase Boots will give you the melee hero move speed buff. Heaven's Halberd will disarm you for the melee hero duration.",
      "Really the only melee hero attribute you don't benefit from is damage block rules.",
      "Agh's Shard Magic Missile bounces prioritize heroes. You can potentially cast the Magic Missile on a nearby creep if a hero is far away and bank on the bounce landing on your target.",
      "A bounced Agh's Shard Magic Missile will still be blocked by Linken's Sphere, but won't reflect from Lotus Orb.",
      "Wave of Terror is a useful spell for scouting out dangerous territory because of its massive range and lingering vision. Also useful for dewarding cliffs.",
      "Wave of Terror damage can cancel consumable regen like Salves or Clarities and break Blink Daggers from long range.",
      "Wave of Terror works on Roshan and the Tormentor.",
      "Vladmir's Offering can be a worthwhile pickup on VS because between Vengeance+Vladmir's Aura you're a huge bonus damage providing hero.",
      "Vengeance Aura boosts damage on player controlled units.",
      "When you die with Agh's Scepter, your Vengeance illusion spawns with its spell cooldowns immediately available.",
      "Your Agh's Scepter Vengeance illusion may be a 'strong' illusion, but it's still an illusion. This means it deals reduced damage versus buildings and Roshan, it can't copy a lot of attack modifiers, it doesn't benefit from + raw armor or + raw damage items, and can't activate items. You don't even get the benefit of Vengeance Aura damage because Vengeance Aura provides + green damage.",
      "Because the Agh's Scepter Vengeance illusion can cast spells, it can also channel Watchers and Outposts.",
      "You'll take your Agh's Scepter Vengeance illusion's place on the map when you respawn even when using buyback.",
      "Nether Swap disables and swaps enemies through debuff immunity/BKB and invulnerability.Being able to Nether Swap invulnerable units means you can Swap heroes that are cycloned or things like Storm Spirit inside Ball Lightning (only if you've started the Swap cast animation before he enters Ball, otherwise he's untargetable once in Ball) or units affected by Naga Siren's Song of the Siren.",
      "Being able to Nether Swap invulnerable units means you can Swap heroes that are cycloned or things like Storm Spirit inside Ball Lightning (only if you've started the Swap cast animation before he enters Ball, otherwise he's untargetable once in Ball) or units affected by Naga Siren's Song of the Siren.",
      "If you're ever against an Enigma, your assignment is to sit around and play with your hair until you can use Swap to break Black Hole.",
      "If things are getting chaotic in a fight, know that you can target spells on allies like Nether Swap by clicking on the allied hero's portrait in the top bar. You can't target spells onenemiesusing top bar portraits, however.",
      "Glimmer Cape can be a handy pickup on VS since you can invisibly get into position, Swap a hero, and then fade out again.",
      "Aether Lens can be a sneaky way to boost Nether Swap's range."
    ],
    "counter_tips": [
      "If you kill Vengeful Spirit, you'll have a debuff on your hero increasing the damage she does to you until the next time you die thanks to her Retribution innate.",
      "Wave of Terror decreases armor dramatically. This means that it's very easy for VS's team to take Rosh early and it means that tower diving a VS can be very dangerous.",
      "During tier 3 tower defenses, make sure that the enemy team doesn't have wards on your high ground, otherwise someone is almost certainly going to get Swapped to the low ground.",
      "Vengeance Aura is granted by illusions of VS. Shadow Demon, Terrorblade, and Dark Seer can take advantage of this.",
      "Vengeance Aura can be disabled byBreaks.Her Agh's Scepter death illusion still spawns even if she's under a break debuff on death, however.",
      "Her Agh's Scepter death illusion still spawns even if she's under a break debuff on death, however.",
      "Venge's Agh's Scepter death illusion is considered a 'strong' illusion.This means it can't be instagibbed by things like hexes or Dagon.However, Brewmaster's Storm Brewling with Dispel Magic deals full damage to all types of illusions.",
      "This means it can't be instagibbed by things like hexes or Dagon.",
      "However, Brewmaster's Storm Brewling with Dispel Magic deals full damage to all types of illusions.",
      "Illusions don't pop Smoke. So if you're running away from a Venge illusion, you can Smoke to lose her. You can also take advantage of this mechanic by offensively smoking to surround an unsuspecting Venge illusion who's farming right before her real hero respawns into it."
    ]
  }
}