{
  "name": "Winter Wyvern",
  "safe_name": "winter_wyvern",
  "strategies": {
    "general_tips": [
      "Be extra aware of the timings for Shrines of Wisdom. Your Eldwurm Scholar innate can make a big experience difference.",
      "Arctic Burn's DoT can only be applied once per enemy per cast and multiple attacks on the same targetdo notrefresh the debuff. Spread your damage out between enemies when in Arctic Burn and pay attention to the buff timer in your status bar to maximize your damage.With Agh's Scepter, multiple Arctic Burn attacks on the same herodorefresh the debuff.",
      "With Agh's Scepter, multiple Arctic Burn attacks on the same herodorefresh the debuff.",
      "Arctic Burn's DoT deals a percentage of the target's current HP as magic damage. Your ideal targets are heroes who have the highestcurrentHP, not max HP.As a result, the DoT can never kill an enemy. Some asymptotic damage up in this bitch.",
      "As a result, the DoT can never kill an enemy. Some asymptotic damage up in this bitch.",
      "When in Arctic Burn, Winter Wyvern can't uphill miss on units or structures. Because she's flying. A rare instance of Dota following logic.",
      "You can travel onto cliffs while in Arctic Burn to scout. Winter Wyvern has higher than average night vision (1200) making this even more useful.",
      "The primary target of Splinter Blastdoes not take damage. I know you're really angry that QoP just Blinked away with 20 HP, but Splinter Blasting her does absolutely nothing. You're better off holding on to the cooldown in case the enemy walks into a creepwave or near some neutrals.Having said that, Splinter Blast is actually a dope Linken's popper because the range is ludicrous.",
      "Having said that, Splinter Blast is actually a dope Linken's popper because the range is ludicrous.",
      "You can target allied units with Splinter Blast, including your team's couriers, but not your own hero.",
      "Splinter Blast's secondary projectiles can hit fogged units, butnotinvis units.",
      "Cold Embrace the creep that's tanking tower shots when pushing; ideally when they're almost dead so they'll heal too.",
      "Cold Embrace protects units fromallphysical damage, including damage from spells like Death Prophet's Exorcism or Bristleback's Quill Spray.",
      "Winter's Curse provides true sight on the primary target.",
      "Winter's Curse applies a dispel on the primary target on cast. This is a rare example of a dispel that can pierce debuff immunity/BKB.",
      "Debuff immune enemiescanbe Winter's Cursed if they're the primary target. However, debuff immune enemieswill notbe taunted into attacking an ally who's Cursed.",
      "The more enemy targets caught by Winter's Curse on cast, the longer the Curse duration. Enemy creeps and summons also add to the duration.Winter's Curse duration is calculated on cast, however. Catching new targets won't extend the taunt.",
      "Winter's Curse duration is calculated on cast, however. Catching new targets won't extend the taunt.",
      "Winter's Curse taunts in the AoE for the full duration of the spell and is sticky on the Cursed unit. You can Force Staff a Cursed enemy to catch fresh enemies or to drag taunted enemies deeper into your territory.",
      "Winter's Curse can be cast onallenemy units, including creeps or summons. The situations in which this could be useful are far and few between, but you could use this to catch enemies who play it fast and loose with Blink Daggers (like Puck or Tinker) by Cursing a creep that's close to where the enemy will be. Or use it to bypass a Linken's Sphere if you just need a quick disable.Casting Winter's Curse on neutral creeps won't taunt enemies. You'll just force some neutrals to murder one of their kin for no reason.Winter's Curse can be cast on Roshan and the Tormentor, but as with other neutrals it won't taunt any enemies. It does make the target only damageable by Wyvern, though.",
      "Casting Winter's Curse on neutral creeps won't taunt enemies. You'll just force some neutrals to murder one of their kin for no reason.",
      "Winter's Curse can be cast on Roshan and the Tormentor, but as with other neutrals it won't taunt any enemies. It does make the target only damageable by Wyvern, though.",
      "Wyvern and any units she owns can damage Winter's Cursed enemies.",
      "Allies cannot damage any enemies under Winter's Curse. Neither primary nor secondary Cursed targets.However, allies can still apply debuffs to Cursed enemies. Like stun/silence them, apply DoTs, build passive stacks (Ursa Fury Swipes, Monkey King Jingu Mastery, etc), or burn their mana.Your teamcandamage an enemy under Winter's Curse (for a percentage of damage)ifthe target is affected by a spell that provides damage amplification. Examples include: Bounty Hunter's Track, Shadow Demon's Menace innate attack debuff, and Undying's Flesh Golem Plague attack debuff.Instant kill spells, like an allied Ancient Apparition Ice Blast, Axe Culling Blade, or Windranger Powershot with the \"Killshot\" facetcankill a target under Winter's Curse if they're below the instant kill HP threshold.",
      "However, allies can still apply debuffs to Cursed enemies. Like stun/silence them, apply DoTs, build passive stacks (Ursa Fury Swipes, Monkey King Jingu Mastery, etc), or burn their mana.",
      "Your teamcandamage an enemy under Winter's Curse (for a percentage of damage)ifthe target is affected by a spell that provides damage amplification. Examples include: Bounty Hunter's Track, Shadow Demon's Menace innate attack debuff, and Undying's Flesh Golem Plague attack debuff.",
      "Instant kill spells, like an allied Ancient Apparition Ice Blast, Axe Culling Blade, or Windranger Powershot with the \"Killshot\" facetcankill a target under Winter's Curse if they're below the instant kill HP threshold.",
      "Most item/spell passives and attack modifiers are coded tonotwork on allies, so don't rely on an enemy critting or mana burning an ally under Curse to get a kill. There are a few exceptions: Slark's Essence Shift, Sniper's Headshot, and Basher/Abyssal bashes will work on allies.Muerta's Gunslingertechnicallyworks on allies but only if there are no other targets for her to Gunsling onto. When any other target is nearby, she'll start Slinging onto it instead of the Cursed target.",
      "Muerta's Gunslingertechnicallyworks on allies but only if there are no other targets for her to Gunsling onto. When any other target is nearby, she'll start Slinging onto it instead of the Cursed target.",
      "Be sure to apply damage to any slippery targets in the Curse with a Splinter Blast before the Curse ends to make sure they don't Blink Dagger out. Remember, only Wyvern can deal damage to the Cursed targets, not your allies."
    ],
    "counter_tips": [
      "Cold Embrace allows for a lot of easy setups for delayed/skillshot spells. Dumb Wyverns will often Embrace allies when they're in clear vision, so try to take advantage of the situation.",
      "Revenant's Brooch can turn right clicks into magic damage allowing you to potentially penetrate Cold Embrace.The tier 5 \"Audacious\" neutral item enchantment adds magic damage to your attacks.",
      "The tier 5 \"Audacious\" neutral item enchantment adds magic damage to your attacks.",
      "You can continue building 'stacks' on a Cold Embrace'd enemy with spells like Slark's Essence Shift, Bristleback's Quill Spray, Ursa's Fury Swipes, etc.",
      "Don't walk into a Cursed ally. Think of the big snowflakey area like a Chronosphere because youwillget sucked into fighting your teammate.",
      "Ethereal Blade or Wind Waker can be used to protect a Cursed target from getting right clicked to death by allies.Pugna's Decrepify could also work.",
      "Pugna's Decrepify could also work.",
      "With the \"Recursive\" facet, Winter's Curse will attempt to re-cast onto the next lowest HP target that's caught in the Curse if the primary target dies. It's considered a full re-cast from Wyvern, so you can potentially outplay this if you're outside the Curse by casting a Linken's Sphere or Lotus Orb onto the ally who's next in line to receive the Curse.",
      "It's extra important to challenge Shrines of Wisdom against a Winter Wyvern thanks to her Eldwurm Scholar innate giving bonus experience to her whole team."
    ]
  }
}