{
  "name": "Witch Doctor",
  "safe_name": "witch_doctor",
  "strategies": {
    "general_tips": [
      "The Gris-Gris item from your innate can be moved out of the neutral slot to a normal inventory slot.",
      "To use the Gris-Gris item innate, you have to right click on the item and select \"Consume Item.\"",
      "Paralyzing Cask can bounce to units in fog.",
      "Cask pops Linken's when targeted or bouncing into a hero, but it'll continue bouncing afterwards.",
      "The fewer units there are around, the more effective Cask is at stunning. In lane, try to pop an enemy with Cask after all their melee creeps die and only the lone ranged creep remains as a bounce target for maximum pinballing.",
      "You can toggle Voodoo Restoration while channeling, such as during Death Ward or TPing. This is extremely important when playing against a Rubick to make sure he can't easily steal your Death Ward.",
      "If you're trying to heal allies with Voodoo Restoration, just right click on them to follow them (assuming you don't have right click allies set to attack), rather than starting the impromptu Dota Hoedown that always occurs whenever people are fumbling to get into the heal AoE.",
      "Maledict can be a good way to keep an enemy Blink Dagger on cooldown since it lasts for so long.",
      "You can choose your Death Ward's target.If you have the \"Unified Orders with CTRL\" setting enabled, you can just ctrl+right click who you want it to attack and you won't break your channel. Or, if you have your hero and Death Ward selected and issue an attack command, it'll only send it to the Ward since you're channeling. Otherwise, just select it manually and right click your target.",
      "Did you know that you can get one extra Death Ward attack off if you spawn it west of your target?It's true!Is this important? Almost never!",
      "You can get Death Ward to stop attacking by issuing it a 'stop' command. Why would you, though?",
      "Death Ward can attack creep-hero units like Brewmaster's Brewlings, Lone Druid's Spirit Bear, Visage's Familiars, or Warlock's Golem.",
      "Death Ward's cast range isn't too shabby. You want to try to exploit the full range every time you cast it so that enemies can't easily get to you to stop your channeling.",
      "Death Ward requires vision of the target to hit them. Beware of casting Death Ward on low ground or near a bunch of trees because your target may escape into fog.",
      "Death Ward provides vision around the unit itself (1200 day/800 night). The vision lingers for 5 seconds after Death Ward disappears.",
      "Agh's Shard Voodoo Switcheroo's Death Ward behaves identically to a normal Death Ward. This means it benefits from Death Ward talents and the Agh's Scepter Death Ward bonuses.This also meansyou can control the targetof the Agh's Shard Voodoo Switcheroo Death Ward by right clicking on the enemy you want to attack.",
      "This also meansyou can control the targetof the Agh's Shard Voodoo Switcheroo Death Ward by right clicking on the enemy you want to attack.",
      "You're stuck in the Agh's Shard Voodoo Switcheroo for the entire cast. You can't cancel it early, it's not a channel, it's more like a fixed duration banish.",
      "Activating Glimmer Cape/Shadow Amulet/Shadow Bladewill notcancel channels, so you can use these items in the middle of channeling Death Ward.Activating Ghost Scepter or BKBwillcancel channels, so use these itemsbeforeyou start channeling Death Ward.",
      "Activating Ghost Scepter or BKBwillcancel channels, so use these itemsbeforeyou start channeling Death Ward.",
      "Aeon Disk being triggered on Witch Doctor does not stop Death Ward from dealing damage since wards are considered separate units. Same reason why an enemy with Blade Mail won't reflect any Death Ward damage onto Witch Doctor.Ward units dealing their own damage also means that building spell amplification items on Witch Doctor will not increase Death Ward's damage.",
      "Ward units dealing their own damage also means that building spell amplification items on Witch Doctor will not increase Death Ward's damage.",
      "Death Ward attacks have 50% accuracy against evasion.",
      "Agh's Scepter Death Ward attacks can bounce to creeps. This can be useful against zoo teams with a lot of summons/units.",
      "Agh's Scepter Death Ward attacks will not bounce to targets in fog."
    ],
    "counter_tips": [
      "Don't sit around next to your ranged creep once the rest of your creep wave dies. You're just asking for a Casking.",
      "Maledict deals extra damage depending on the amount of HP you've lost since the debuff was applied. If you heal yourself, you'll take less damage on the next curse tick.",
      "The burst damage tick from Maledict triggers once every 4 seconds. Try timing whatever invincibility you may have (like from a banish) at those times.",
      "Someone on your team needs to be dedicated to canceling WD's Death Ward. You only need one stun/silence/banish to completely shut it down.",
      "Death Ward can't hit ethereal units. This makes Ghost Scepter a useful item if you're a support who keeps dying to the ult."
    ]
  }
}